[
    {
        "source": "https://nepalprabin.github.io./posts/2020-08-23-neural-style-transfer-and-its-working.html",
        "title": "Neural style transfer and its working",
        "full_text": "Neural style transfer and its working\n\nHave you ever used an app called Prisma that styles your image using popular paintings and turns your photo stunning? If that’s the case then, the app you are using is the result of style transfer; a computer vision technique that combines your images with artistic style.\n\nIntroduction\n\nStyle transfer is a computer vision technique that takes two images: content image and style image, combines them to form a resulting image that style the image based on style image taking contents from the content image.\n\nHere is how it looks like:\n\nThe content image you can see above is Van Gogh’s Starry Night Painting and the style image a image from Tubingen university from Germany. Resultant image is shown on the right side that used content of content image and is styled using style image.\n\nNow let’s get into the working of neural style transfer\n\nNeural Style Transfer is based on Deep Neural Network that create images of high perpetual quality. It uses neural network to separate and recombine content and style of images that we feed to obtain the desired result. The original paper uses 19 layer VGG network comprising of 16 convolutional layers, 5 max-pooling layers and 3 fully connected layers.\n\nFig. A 19 layer VGG networksource\n\nHow exactly do we obtain such images?\n\nOur goal here is to apply style over our content image. We are not training any neural network in this case, rather we start from a blank image and optimize the cost function by changing the pixel values of the image. The cost function contains two losses: Content loss and Style loss.\n\nConsidering c as the content image and x as the style transferred image, content loss tends to\\(0\\)when\\(x\\)and\\(c\\)are close to each other and increases when these value gets increased.\n\nGiven the original image\\(vec{p}\\)and generated image\\(vec{x}\\), we can define the loss generated by the content image as:\n\nContent loss takes content weight which is a scalar that gives weighting for the content loss, content_current that gives features of the current image. content_current is the Pytorch tensor having shape (1,\\(C_l\\),\\(H_l\\),\\(W_l\\)), where\\(C_l\\)is the number of channels in layer\\(l\\),\\(H_l\\)and\\(W_l\\)are width and height.\n\ndef content_loss(content_weight, content_current, content_original):\n    return torch.sum(content_weight * (content_current-content_original)**2)\n\nAfter computing content loss, we can compute style loss.To compute style loss, we need to first compute Gram matrix\\(G\\). Gram matrix represents the correlation between responses of each filter. Given a feature map\\(F^l\\)of shape\\((C_l, M_l)\\), the Gram matrix is given by:\n\n\\[G_{ij}^\\ell  = \\sum_k F^{\\ell}_{ik} F^{\\ell}_{jk}\\]\n\nGram matrix in python:\n\ndef gram_matrix(features, normalize=True):\n    N, C, H, W = features.size()\n    features = features.reshape(N, C,-1)\n\n    gram_matrix = torch.zeros([N,C,C]).to(features.device).to(features.dtype)\n    for i in range(N):\n      gram_matrix[i,:] = torch.mm( features[i,:], features[i,:].t())\n      if (normalize):\n        gram_matrix /= float(H*W*C)\n      return gram_matrix\n\nNow implementing style loss:\n\ndef style_loss(feats, style_layers, style_targets, style_weights):\n    loss = 0\n    for i, layer in enumerate(style_layers):\n      gram_feat = gram_matrix(feats[layer])\n      loss += (style_weights[i] * torch.sum((gram_feat-style_targets[i])**2))\n    return loss\n\nTo increase the smoothness in the image, we can use another term to our loss that penalizes total variation in the pixel values. We can compute the “total variation” as the sum of the squares of differences in the pixel values for all pairs of pixels that are next to each other (horizontally or vertically). Here we sum the total-variation regualarization for each of the 3 input channels (RGB), and weight the total summed loss by the total variation weight, w_t\n\nTotal variational loss in python\n\ndef tv_loss(img, tv_weight):\n  loss = 0\n  loss += torch.sum((img[:,:,1:,:]-img[:,:,:-1,:])**2)\n  loss += torch.sum((img[:,:,:,1:]-img[:,:,:,:-1])**2)\n  loss *= tv_weight\n  return los\n\nCombining above snippets together, we can generate resultant image using content and style images. The complete code is available ongithub. Code is the homework solution forDeep Learning for Computer Visiontaught by Justin Johnson.\n\nReferences\n\n- Image Style Transfer Using Convolutional Neural Networks\n- A Neural Algorithm of Artistic Style\n- Deep Learning for Computer Vision"
    },
    {
        "source": "https://nepalprabin.github.io./posts/2021-01-01-deep-residual-learning-for-image-recognition-resnet-paper-explained.html",
        "title": "Deep Residual Learning for Image Recognition (ResNet paper explained)",
        "full_text": "Deep Residual Learning for Image Recognition (ResNet paper explained)\n\nDeep Neural Networks tend to provide more accuracy as the number of layers increases. But, as we go more deeper in the network, the accuracy of the network decreases instead of increasing. As more layers are stacked, there occurs a problem ofvanishing gradients. The paper mention that vanishing gradient has been addressed by normalized initialization and intermediate normalization layers. With the increase in depth, the accuracy gets saturated and then degrades rapidly.\n\n*Vanishing gradient: Vanishing gradient is a situation where a deep multilayer feedforward network or RNN is unable to propagate useful gradient information from output end of the model to the layers near the input end of the model. In this case, the gradient becomes very small and prevents weights from changing its value. It causes network hard to train.\n\nThe above figure shows that with the increase in depth of the network, training error increases thus increasing test error. Here, the training error on 20 layer network is less than that of 56 layer network. Thus, the network cannot generalize well for new data and becomes an inefficient model. This degradation indicates that increasing the model layer does not aid in the performance of the model and not all the system are easy to optimize.\n\nThe paper address the degradation problem by introducing a deep residual learning framework. The main innovation for ResNet is the residual module. Residual module is specifically an identity residual module, which is a block of two convolutional layers with same number of filters and a small filter size. The output of the second layer is added with the input to the first convolution layer.\n\nResidual learning: a building block.source\n\nNetwork Architecture\n\nThe paper took baseline model of VGGNet as a plain network with mostly 3x3 filters with two design rules: a) for the same output feature map size, the layers have the same number of filters and b) if the feature map size is halved, the number of filters is doubled so as to preserve the time complexity per layer. The network is ended with a global average pooling layer and a 1000-way fully connected layer with a softmax.\n\nBased on the plain network, shortcut connections are added to transform plain version into residual version.\n\nLeft: VGG-19 modelMiddle: Plain network with 34 parameter layersRight: residual network with 34 parameter layerssource\n\nImplementation\n\n- Image was first resized with its shorter side sampled into 256 x 480\n- Data augmentation techniques was carried out\n- Batch normalization was carried out after each convolution and before activation\n- Stochastic gradient descent was used for training the network with mini batch of 256.\n- Weight decay of 0.0001 and momentum of 0.9 was used.\n\nExperiments\n\nResnet architecture was evaluated on ImageNet 2012 classification dataset consisting of 1000 classes. The model was trained on the 1.28 million training images and evaluated on the 50k validation images. Moreover, 100k images were used for testing the model accuracy.\n\nWhile performing experiments on plain networks, a 34-layer plain network showed a higher validation error than an 18-layer plain network. Training error for the 34-layer plain network was found to be higher than the 18-layer plain network. Here, a degradation problem occurred as we go deep into the network. The deep plain networks may have a low convergence rate that impacts the accuracy of the model (impacts in reducing the training error).Different from the plain network, a shortcut connection was added to each pair of 3x3 filters. With a same number of layers as in plain network, Resnet 34 performed better than Resnet 18 network. Resnet-34 showed less error and performs well in generalizing validation data. This resolves the problem of degradation as seen on a plain deep network. The comparison for both plain and residual network is shown below:\n\nTraining on ImageNet. Thin curves denote training error, and bold curves denote validation error of the center crops. Left: plain networks of 18 and 34 layers. Right: ResNets of 18 and 34 layers. In this plot, the residual networks have no extra parameter compared to their plain counterparts.source\n\n- Deep Residual Learning for Image Recognition"
    },
    {
        "source": "https://nepalprabin.github.io./posts/2023-05-15-gpt4-summary.html",
        "title": "Brief overview of GPT-4",
        "full_text": "Brief overview of GPT-4\n\nSince the release of ChatGPT, there has been significant interest and discussion within the broader AI and natural language processing communities regarding its capabilities. In addition to this, ChatGPT has captured the attention of the internet at large due to its remarkable ability to generate fluent and natural-sounding responses across a wide range of prompts and language tasks. Due to this, it became fastest growing consumer application in the history, just two months after the launch. ChatGPT is fine-tuned from a model in the GPT-3.5 series and can write articles, jokes, poetrys in response to the prompt. Though powerful, there have also been concerns raised about the potential risks associated with it and other large language models (LLMs), particularly with respect to issues such as bias, and misinformation. One of the major concern for LLMs is that it suffers fromhallucination.\n\nA year after releasing ChatGPT, OpenAI released GPT-4 (on 14th March, an improved version of GPT-3.5 model that supports multimodal data. It is capable of processing text and image data to generate textual data. It achieved human level performance on various professional and academic benchmarks. On a simulated bar exam, GPT-4 achieved a score that falls on the top 10% of the exam takes. In contrast, the score achieved by previous model GPT-3.5 fell on bottom 10%. This shows the level of improvement achieved by the latest version of GPT. It is also important to mention that the model was not specifically trained on these exams. A minority of problems were seen by model while training.\n\nCapabilities of GPT-4\n\nThough the report does not provide any details about architecture (including model size), hardware, training compute, dataset construction, or training method, a demo run byGreg Brockman(President and Co-founder, OpenAI) after the release of GPT-4 shows various capabilities of the model.\n\nYou can watch the GPT-4 Developer Livestream replay here:\n\n1. Supports longer context\n\nGPT-4 is capable of handling over 25,000 words of text, that enables its usage in situations that require the creation of lengthy content, extended dialogues, or the exploration and analysis of extensive documents.\n\n2. Hand-drawn pencil drawing turned into a fully functional website\n\nGPT-4 is also capable of handling visual input, such as hand-drawn pencil drawings that looks like a mock design, and generating code to create a website. The generated output is mind blowing. Another important aspect is the accuracy by which the model is able to perform OCR task with such messy handwritings.\n\nFig. Left is the mock design and right is the website created using the code generated from gpt4-model.source\n\n3. GPT-4 can describe the image.\n\nAs opposed to text on prompts (on previous GPT version), this model accepts inputs containing both text and images. It lets user specify any language or vision tasks. GPT-4 displays comparable skills on various types of content, such as documents containing both textual and visual elements like photographs, diagrams, or screenshots, as it does when dealing with text-only inputs.\n\nExample prompt demonstrating GPT-4’s visual input capability. The prompt consists of a question about an image with multiple panels which GPT-4 is able to answer.source\n\n4. Human level performance on professional and academic benchmarks\n\nGPT outperforms the previous state-of-the-art models on various standardized exams, such as GRE, SAT, BAR, and APs, along with other research benchmarks like MMLU, HellaSWAG, and TextQA. GPT-4 outperforms the English language performance of GPT 3.5 and existing language models (ChinchillaandPaLM), including low-resource languages such as Latvian, Welsh, and Swahili.\n\nLimitations of GPT-4\n\n- Though there has been a tremendous improvement as compared to previous models, GPT-4 has similar limitations as earlier GPT models. It is not fully reliable and hallucinates.\n- Since GPT-4 is trained on the data available till September 2021, it lacks knowledge of the events occured after that time period.\n\nRisks and mitigations\n\nThe prompts entered by the users are not always safe. When providing unsafe inputs to the model, it may generate undesirable text like commiting crimes. To mitigate these risks, various approaches like Adversarial Testing, Model Assisted Safety Pipeline are carried out. Using domain experts and their findings, model is improved to refuse request for unsafe inputs like synthesizing dangerous chemicals.\n\n                   Examples of how unsafe inputs are refused by the model\n\nConclusion\n\nThe recent advancements in GPT-4, have proven to outperform existing language models in a collection of NLP tasks. The improved capabilities of GPT-4 are not limited to the English language, as predictable scaling allows for accurate predictions in many different languages. However, the increased capabilities of GPT-4 also present new risks, which require significant work to understand and improve its safety and alignment. Nevertheless, GPT-4 marks a significant milestone towards the development of broadly useful and safely deployed AI systems.\n\nReferences:\n\n- GPT-4 Technical Report\n- GPT-4 Blog Post\n- chat.openai.com\n\nPS\n\nWhile GPT-4 may have stolen the headlines, it was not the only new technology on display. AnthropicAI unveiledClaude, next gen AI assistant can help with use cases including summarization, search, creative and collaborative writing, Q&A, coding, and more. Meanwhile, Google AI releasedPaLM, an entry point for Google’s large language models with variety of applications. With these three new systems, the future of AI looks brighter than ever before."
    },
    {
        "source": "https://nepalprabin.github.io./posts/2020-08-04-general-adversarial-networks-gans.html",
        "title": "General Adversarial Networks (GANs)",
        "full_text": "General Adversarial Networks (GANs)\n\n“General Adversarial Netsis the most interesting idea in the last 10 years in machine learning”. This was the statement from Yann LeCun regarding GANs when Ian Goodfellow and co-authors introduced it in 2014. After its first introduction, many research papers are published with various architectures and its use cases.\n\nSo what are General Adversarial Networks? What are its use cases. In this post I will try to explain about GANs, its underlying math, use cases and GAN implementation in keras.\n\nIntroduction\n\nAs stated by Ian Goodfellow on hispaper, GAN is a framework for estimating generative models via an adversarial process. During this process, two models are trained. One is called generator\\(G\\)and another model is called as discriminator\\(D\\). Generator\\(G\\)generates new examples that are similar to original data. Discriminator model\\(D\\)classifies whether the data is real or fake. To keep in simple terms, generator is analogous to counterfeiters, whereas discriminator is analogous to police. Counterfeiters tries to produce fake currency and use it, while police try to detect the fake currency. Counterfeiters come up with new ideas and patterns to make the fake money as similar to the original and fool the police. Similarly, police tries to detect the fake money. Similar is the case with GAN. Generative model tries to create fake data samples and fool the discriminator and discriminator classifies whether data is fake or not. This process goes on until data samples generated by generator are indistinguishable from discriminator.\n\nConsider the following notations for different data points and distributions:Generator’s distribution:\\(p_g\\)Data:\\(x\\)Input noise variables:\\(p_z(z)\\)Then,\\(G\\)is a generator model represented by multilayer perceptron with parameters\\(\\theta_g\\)(parameters of weights and biases).\n\nSimilarly,\\(D\\)is a discriminator model also represented by multilayer perceptron\\(D(x;\\theta\\_d)\\). Then,\\(D(x)\\)represents a probability that data\\(x\\)came from original distribution rather than\\(p_g\\).\n\nA known dataset serves as input for the discriminator. Training involves presenting samples from the training dataset until it achieves acceptable accuracy. Generator however trains based on whether it fools the discriminator. The input to generator is the data samples from latent space ( e.g, multivariate normal distribution). Then, the output generated by the generator is evaluated by the discriminator. Both generator and discriminator model goes through backpropagation to reduce the loss. During this step, generator generates better data samples (say images), whereas discriminator becomes good in classifying fake samples coming from the generator. This way, discriminator\\(D\\)and generator\\(G\\)play two-player min-max game.\n\nTraining procedure for GANs\n\n- Take a random noise vector\\(z\\)and feed to the generator\\(G\\)to produce fake examples\\(x^*\\). Here label y=0 for\\((x, y)\\)input-output pair.\n- Take fake data\\(x^*\\)and real data\\(x\\)and feed to the discriminator model alternatively.\n- Since, discriminator\\(D\\)is a multilayer perceptron, it outputs value between 0 and 1. These values indicates the probability that input is real.\n- Both generator and discriminator calculates their respective loss and perform backpropagation to reduce the loss.\n- Discriminator tries to maximize the probability of assigning correct labels to both original data and data from random samples.\n- Similarly, generator tries to minimize the discriminator’s ability to detect correct and fake samples.\n\nThese two networks go on competing with each other until they reach Nash equilibrium. Nash equilibrium is a point in a game where neither player can improve their situation by changing their strategy. More on Nash equilibrium can be foundhere. The overview of GAN architecture is shown below:\n\nFig. GAN\n\nThe noise vector z is transformed into x* by a generator model which is then fed into discriminator network. Similarly, data from original sample is also fed into discriminator. The discriminator in result outputs a classification values close to 1 for real data x. While for data x*, discriminator tries to output value 0 indicating that x* is fake.\n\nDerivation of Loss function for GANs\n\nSince, GAN is trained in multilayer perception, its loss can be calculated using cross-entropy loss given as:\\(L(y, y\\hat{})\\)=\\([y\\log y\\hat{} + (1-y) log(1-y\\hat{} )]\\)The label for the data coming from\\(p_{data}(x)\\)is\\(y = 1\\)and\\(y\\hat{}\\)=\\(D(x)\\).So, the cross-entropy equation becomes:\\(L(D(x), 1)\\)=\\(log(D(x))\\)————–(A)\n\nSimilarly, for data coming from generator the label is\\(y=0\\)and\\(y\\hat{}=D(G(z))\\)In this case, our cross entropy equation becomes:\\(L(D(G(z)), 0)\\)=\\((1-0) log(1-D(G(z))\\)=\\(log(1-D(G(z))\\)————–(B)\n\nWe know that the objective of discriminator is to correctly classify fake versus real data. To achieve this equations (A) and (B) should be maximized.\\(max\\){\\(log (D(x))\\)+\\(log(1-D(G(z)))\\)}\n\nThe role of generator is to fool discriminator so as to predict fake data as real, i.e., to achieve\\(D(G(z)) = 1\\). So, the objective function for generator is given as:\\(min\\){\\(log (D(x))\\)+\\(log(1-D(G(z)))\\)}\n\nNote:\\(log(D(x))\\)has nothing to do with generator objective function. It is kept to provide compact representation of generator and discriminator objective function in our equation.\n\nCombining the objective function of both discriminator and generator, we get following equation:\\(\\min\\_{G}\\)\\(\\max\\_{D}\\){\\(log (D(x))\\)+\\(log(1-D(G(z)))\\)}All the above equations are written with respect to a single instance of data point (x). To consider all the instances of x, we need to take expectation of the whole arguments present in the equation which results in the following equation:\n\nApplications of GANs\n\n- Image-to-Image Translation\n- Image-to-Text Translation\n- To generate realistic photographs\n- Photo Inpainting and many more\n\nImplementation of GAN\n\nSince, GANs consists of two models, generator and discriminator model, we need to build two models. Before building models let’s import libraries. The code snippets for GAN implementation is taken fromGANs in Actionbook.\n\nfrom keras.datasets import mnist\nfrom keras.layers import Dense, Flatten, Reshape\nfrom keras.layers.advanced_activations import LeakyReLU\nfrom keras.models import Sequential\nfrom keras.optimizers import Adam\n\nSince we will use mnist data to train our discriminator, we need 28*28 image size for our generator for generating new images.\n\nimg_rows = 28\nimg_cols = 28\n\nchannels = 1\nimg_shape = (img_rows, img_cols, channels)\n\nz_dim  = 100\n\nz_dim is the size of noise vector used as input to generator model\n\nNow, we’ll build a generator model\n\ndef build_generator(img_shape, z_dim):\n  model = Sequential()\n\n  model.add(Dense(128, input_dim=z_dim))\n  model.add(LeakyReLU(alpha=0.01))\n  model.add(Dense(28*28*1, activation='tanh'))\n  model.add(Reshape(img_shape))\n  return model\n\nSimilarly, building generator model\n\ndef build_discriminator(img_shape):\n  model = Sequential()\n  model.add(Flatten(input_shape=img_shape))\n  model.add(Dense(128))\n  model.add(LeakyReLU(alpha=0.01))\n  model.add(Dense(1, activation='sigmoid'))\n  return model\n\nNow, we will build GAN using generator and discriminator build previously. While using combined model to train generator, we keep the parameters of discriminator model fixed. Also, discriminator is trained as an independently compiled model.\n\ndef build_gan(generator, discriminator):\n  model = Sequential()\n  model.add(generator)\n  model.add(discriminator)\n\n  return model\n\ndiscriminator = build_discriminator(img_shape)\ndiscriminator.compile(loss='binary_crossentropy', optimizer=Adam(), metrics=['accuracy'])\n\ngenerator = build_generator(img_shape, z_dim)\ndiscriminator.trainable = False\ngan = build_gan(generator, discriminator)\ngan.compile(loss='binary_crossentropy', optimizer=Adam())\n\nNow, that we have build our GAN model, we now train our GAN model. MNIST images is taken as real examples and fake image is generated from noise vector z. These are used to train discriminator network while keeping generator’s parameters constant. Similarly, fake images are generated and we used those images to train generator network by keeping discriminator’s parameter constant.\n\nThe images produced by generator over the course of training iterations is shown below\n\nDuring training, random noise is generated and generator gradually learns to imitate the features of training dataset.\n\nThis is the output from two layer general adversarial networks. It is gradually imitating the features of MNIST images.\n\nReferences\n\n- Ian J. Goodfellow et. al.Generative Adversarial Nets.\n- https://en.wikipedia.org/wiki/Generative_adversarial_network\n- Ahlad Kumar (GAN youtube playlist)"
    },
    {
        "source": "https://nepalprabin.github.io./posts/2021-03-26-simclr-explained.html",
        "title": "Paper Explanation: A Simple Framework for Contrastive Learning of Visual Representations (simCLR)",
        "full_text": "Paper Explanation: A Simple Framework for Contrastive Learning of Visual Representations (simCLR)\n\nVarious self-supervised learning methods have been proposed in recent years for learning image representations. Though a lot of methods have been proposed, the performance of those methods was found less effective in terms of accuracy than those of supervised counterparts. ButSimCLRhas provided promising results, thus taking self-supervised learning to a new level. It uses a contrastive learning approach. This paper introduces a simple framework to learn representations from unlabeled images based on heavy data augmentation. Before going deep into simCLR and its details, let’s see what contrastive learning is:\n\nContrastive Learning\n\nContrastive learning is a framework that learns similarities/dissimilarities from data that are organized into similar/dissimilar parts. It can also be considered as learning by comparing. Contrastive learning learns by comparing among different samples. The samples can be performed between positive pairs of ‘similar’ inputs and negative pairs of ‘dissimilar’ inputs.\n\nTo illustrate this in another way, you’re told to chose a picture that is similar to the picture on the left i.e, cat (on the image below). You look at the picture and find the image from a bunch of images present(on the right side) that is similar to the cat. This way, you contrast between similar and dissimilar objects. The same is the case with contrastive learning. Using this approach we can train a machine learning model to classify between similar and dissimilar objects.\n\nSource: GoogleAI\n\nContrastive learning approaches only need to define the similarity distribution in order to sample a positive input\\(x^{+} \\sim\\ p^{+}\\)\n\nContrastive learning approaches only need to define the similarity distribution in order to sample a positive input\\(x^{+} \\sim\\ {p^{+}(.|x)}\\), and a data distribution for a negative input\\(x^{-} \\sim\\ p^{-}(.|x)\\), with respect to an input sample\\(x\\). The goal of Contrastive learning is: the representation of similar samples should be mapped close together, while that of dissimilar samples should be further away from embedding space.\n\nSource:Contrastive Representation Learning: A Framework and Review\n\nA Simple Framework for Contrastive Learning of Visual Representations - SimCLR\n\nHow does simCLR learn representations?simCLR learns representations by maximizing agreement between differently augmented views of the same data example via a contrastive loss.\n\nInorder to learn good contrastive representation learning, simCLR consists of four major components\n\n-Data Augmentation module: Data augmentation is more beneficial for unsupervised contrastive learning than supervised learning. The data augmentation module transforms any given data example into two correlated views of the same example. These examples are denoted as\\(\\\\widetilde{x\\_i}\\)and\\(\\\\widetilde{x\\_j}\\), considered as positive pair. The authors mainly applied three augmentations sequentially:random croppingfollowed by resizing to the original size, randomcolor distortions, and randomGaussian blur.\n\n- Encoder: A neural base encoder\\(f(.)\\)is used that extracts features from augmented data examples. ResNet is used as the architecture to extract those representations. The learned representation is the result of the average pooling layer.\n- Projection head: The projection head\\(g(.)\\)is a MLP with one hidden layer that maps representations from the base encoder network to space where contrastive loss is applied. Here ReLU activation function is used for non-linearity.\n- Contrastive loss function: For any given set of\\(\\\\widetilde{x\\_k}\\)which includes positive example pair\\(\\\\widetilde{x\\_i}\\)and\\(\\\\widetilde{x\\_j}\\), contrastive prediction task aims to identify\\(\\\\widetilde{x\\_j}\\)in {\\(\\\\widetilde{x\\_k}\\)} (here i and k are not equal) for given\\(\\\\widetilde{x\\_i}\\)\n\nsimCLR FrameworkGoogle AI\n\nWorking of simCLR algorithm\n\nFirst, we generate a batch of N examples and define contrastive prediction tasks on augmented examples. After applying a series of data augmentation techniques random(crop + resize + color distortion + grayscale) on N examples, 2N data points are generated (since we are generating similar pairs in a batch). Each augmented image is passed in a pair through the base encoder to get a representation from the image. Followed by the base encoder, a projection head is used that maps the base encoder to the representation\\(z\\_i\\)and\\(z\\_j\\)as presented in the paper. For each augmented image, we get embedding vectors for it. These embedding vectors are later subjected for calculating loss.\n\nsimCLR algorithm\n\nCalculating loss\n\nAfter getting the representations of the augmented images, the similarity of those images is calculated using cosine similarity. For two augmented image,\\(x\\_i\\)and\\(x\\_j\\), cosine similarity is calculated on projected representations\\(z\\_i\\)and\\(z\\_j\\).\n\n\\(s\\_{i,j} = \\\\frac{z\\_i^{T}z\\_j}{||z\\_i||||z\\_j||}\\), where\\(T\\)denotes a temperature parameter,\\(||z||\\)is the norm of the vector\n\nsimCLR usesNT-Xent(Normalized temperature-scaled cross entropy loss) for calculating the loss.\n\nHere\\(z\\_i\\)and\\(z\\_j\\)are the output vectors obtained from the projection head\n\nAfter training simCLR on the contrastive learning task, it can be used for transfer learning. For downstream tasks, representations from encoder are used rather than the representation from projection head. These representations can be used for tasks such as classification, detection.\n\nResults\n\nThe proposed simCLR outperformed previous self-supervised and semi-supervised methods on ImageNet. A linear classifier trained on self-supervised representations learned by SimCLR achieves 76.5% top-1 accuracy, which is a 7% relative improvement over previous state-of-the-art, matching the performance of a supervised ResNet-50. When fine-tuned on only 1% of the labels, we achieve 85.8% top-5 accuracy, outperforming AlexNet with 100× fewer labels.\n\nImageNet Top-1 accuracy of linear classifiers trainedon representations learned with different self-supervised methods (pre-trained on ImageNet). Gray cross indicates supervisedResNet-50. Our method, SimCLR, is shown in bold\n\nReferences\n\n- “A Simple Framework for Contrastive Learning of Visual Representations”\n- “SimCLR Slides, Google Brain Team”\n- Contrastive Representation Learning: A Framework and Review\n- The Illustrated SimCLR Framework"
    },
    {
        "source": "https://nepalprabin.github.io./posts/2020-12-08-self-supervised-learning.html",
        "title": "Self-supervised Learning",
        "full_text": "Self-supervised Learning\n\nI have been exploring self-supervised learning and been through papers and blogs to understand it. Self-supervised learning is considered the next big thing in deep learning and why not! If there is a way to learn without providing labels, then this enables us to leverage a large amount of unlabeled data for our tasks. I am going to provide my understanding of self-supervised learning and will try to explain some papers about it.\n\nWe have been familiar with supervised learning wherein we provide features and labels to train a model and the model uses those labels to learn from the features. But labeling data is not an easy task as it requires more time and manpower. There is a large amount of data being generated daily and is unlabeled. The generated data may be in the form of text, images, audio, or videos. Those data can be used for different purposes. But there is a catch. These data do not contain labels and it difficult to work on these sorts of data. Here comes self-supervised learning to the rescue.\n\nSo what is self-supervised learning and why is it needed?\n\nSelf-supervised learning is a learning framework that does not use human-labeled datasets to learn a visual representation of the data also known as representation learning. We have been familiar with the task such as classification, detection, and segmentation where a model is trained in a supervised manner which is later used for unseen data. These tasks are normally trained for specific scenarios, for e.g, the ImageNet dataset contains 1000 categories and can only recognize those categories. For categories that are not included in the ImageNet dataset, new annotations need to be done which is an expensive task. Self-supervised makes learning easy as it requires only unlabeled data to formulate the learning task. For training models in a self-supervised manner with unlabeled data, one needs to frame a supervised learning task (also known as*pre-text task). These pre-text tasks can later be used for**downstreamtasks such as image classification, object detection, and many more.\n\n*Pre-text task: These are the tasks that are used for pre-training**Downstream task: These are the task that utilizes pre-trained model or components that can be used to perform tasks such as image recognition, segmentation.\n\nA general pipeline of self-supervised learning (source)\n\nSelf-supervised Techniques for Images\n\nMany ideas have been proposed for self-supervised learning on images. A more common methodology or workflow is to train a model in one or multiple pretext tasks with the use of unlabeled data and use that model to perform downstream tasks. Some of the proposed ideas of self-supervised techniques for images are summarized below:\n\nRotation\n\nTo learn representation by predicting image rotations,Gidaris et al.proposed an architecture where features are learned by training Convolution Nets to recognize rotations that are applied to the image before feeding to the network. This set of geometric transformations defines the classification pretext task that the model has to learn which can later be used for downstream tasks. Geometric transformation is made such that the image is rotated through 4 different angles (0, 90, 270, and 360). This way, our model has to predict one of the 4 transformations that are done on the image. To predict the task, our model has to understand the concept of objects such as their location, their type, and their pose.\n\nIllustration of the self-supervised task proposed for semantic feature learning.Given four possible geometric transformations, the 0, 90, 180, and 270 degrees rotations,a ConvNet model was trained to recognize the rotation that is applied to the image that it gets as input. (source)\n\nMore details at:Unsupervised Representation Learning By Predicting Image Rotations\n\nExemplar\n\nIn Exemplar-CNN (Dosovitskiy et al., 2015), a network is trained to discriminate between a set of surrogate classes. Each surrogate class is formed by applying random data augmentations such as translation, scaling, rotation, contrast and color shifts. While creating surrogate training data:\n\n- N patches of size 32 x 32 pixels are randomly sampled from different images at varying positions. Since, we are interested in patches objects or parts of objects, random patches are sampled only from region containing considerable gradients.\n- Each patch is applied with a variety of image transformations. All the resulting transformed patches are considered to be in same surrogate classes.\n\nThe pretext task is to discriminate between the set of surrogate class.\n\nSeveral random transformations applied to one of thepatches extracted from the STL unlabeled dataset. The originalpatch is in the top left corner (source)\n\nMore details at:Discriminative Unsupervised Feature Learning with Exemplar Convolutional Neural Networks\n\nJigsaw Puzzle\n\nAnother approach of learning visual representation from unlabeled dataset is by training a ConvNet model to solve Jigsaw puzzle as a pretext task which can be later used for downstream tasks. In Jigsaw puzzle task, model is trained to place 9 shuffled patches back to the original position. To place shuffled patches to original position,Noroozi et al.proposed a Context Free Network (CFN) which is a siamese CNN that uses shared weights. The patches are combined in a fully connected layer.\n\nLearning image representations by solving Jigsaw puzzles.\n\n- The image from which the tiles (marked with green lines) are extracted.\n- A puzzle obtained by shuffling the tiles.\n- Determining the relative position between the central tile and the top two tiles from the left can be very challengingsource\n\n- The image from which the tiles (marked with green lines) are extracted.\n- A puzzle obtained by shuffling the tiles.\n- Determining the relative position between the central tile and the top two tiles from the left can be very challengingsource\n\nFrom the set of defined puzzle permutations, one permutation is randomly picked to arrange those 9 patches as per that permutation. This results CFN to return a vector with a probability value for each index. Given those 9 tiles, there will be 9! = 362,880 possible permutations. This creates difficulty in jigsaw puzzles. To control this, the paper proposed to shuffle patches according to a predefined set of permutations and configured the model to predict a probability vector over all the indices in the set.\n\nContext Free Network Architecture (source)\n\nMore details at:Unsupervised Learning of Visual Representations by Solving Jigsaw Puzzles\n\nRelative Patch Location\n\nThis approach byDoersch et al, predicts position of second patch of the image that is relative to the first patch. For this pretext task, a network is fed with two input patches and is passed through several convolutional layers. The network produces an output with probability to each of eight image patches. This can be taken as a classification problem with 8 classes where the input patch is assigned to one of these 8 classes to be considered as relative patch to the input patch.\n\nThe algorithm receives two patches in one of these eightpossible spatial arrangements, without any context, and must thenclassify which configuration was sampled (source)\n\nMore details at:Unsupervised Visual Representation Learning by Context Prediction\n\nReferences:\n\n- The Illustrated Self-Supervised Learning\n- Self-supervised Learning\n- Self-supervised Visual Feature Learning with Deep Neural Networks: A Survey"
    },
    {
        "source": "https://nepalprabin.github.io./posts/2025-03-02-huggingface-smolagents-solutions.html",
        "title": "Huggingface AI Agents Quiz Solutions",
        "full_text": "Huggingface AI Agents Quiz Solutions\n\nI have been diving into AI agents through Huggingface’s AI Agents Course. This course offers a comprehensive understanding of how to build and deploy AI agents using thesmolagentslibrary. In this blog, I’ll share insights from the course (Unit 2) and provide code snippets to illustrate key concepts.\n\nHere is the course link if anyone is interested.AI Agents Course\n\nCreate a Basic Code Agent with Web Search Capability\n\nOne of the foundational exercises involves creating a CodeAgent equipped with web search capabilities. This agent leverages the DuckDuckGoSearchTool to perform web searches, enabling it to fetch real-time information. Here’s how you can set it up:\n\n    # Create a CodeAgent with DuckDuckGo search capability\n    from smolagents import CodeAgent, DuckDuckGoSearchTool, HfApiModel\n\n    agent = CodeAgent(\n        tools=[DuckDuckGoSearchTool()],           # Add search tool here\n        model=HfApiModel(\"Qwen/Qwen2.5-Coder-32B-Instruct\")          # Add model here\n    )\n\nIn this snippet, we initialize a CodeAgent with the DuckDuckGoSearchTool, allowing the agent to perform web searches to answer queries.\n\nSet Up a Multi-Agent System with Manager and Web Search Agents\n\nMulti-Agent systems are the agents that are specialized on complex tasks with more scalable and robust nature. Insmolagents, various agents can be integrated to produce Python code, invoke external tools, conduct web searches, and more. By coordinating these agents, it’s possible to develop robust workflows. A typical multi-agent system includes:\n\n    - A manager Agent\n    - A code interpreter Agent\n    - A web Search Agent\n\nMulti-agent system allows to separate memories between different sub-tasks and provide great benefits. Firstly, each agent are more focused on its core taks and secondly, separating memories reduces the count of input tokens resulting in reducing latency and cost. Below is the multi-agent system whenweb_agentperforms search andmanager_agentgives data analysis capabilities. Also, we can import dependencies (like python libraries) that helps to perform the tasks.\n\n    from smolagents import CodeAgent, ToolCallingAgent, DuckDuckGoSearchTool, HfApiModel, VisitWebpageTool\n\n    web_agent = ToolCallingAgent(\n        tools=[DuckDuckGoSearchTool(), VisitWebpageTool()], \n        model=HfApiModel(model_id=\"Qwen/Qwen2.5-Coder-32B-Instruct\"),\n        max_steps=10,\n        name=\"search\", \n        description=\"Agent to perform web searches and visit webpages.\"\n    )\n\n\n    manager_agent = CodeAgent(\n        model=HfApiModel(model_id=\"Qwen/Qwen2.5-Coder-32B-Instruct\"),\n        managed_agents=[web_agent],\n        additional_authorized_imports=[\"pandas\", \"time\", \"numpy\"] # Corrected imports\n    )\n\nConfigure Agent Security Settings\n\nSecurity is a crucial aspect when deploying AI agents, especially when they execute code. Below code snippet uses E2B to run code in a sandboxed environment. It is a remote execution that run the code in a isolated container.\n\n    from smolagents import CodeAgent, HfApiModel\n    from smolagents.sandbox import E2BSandbox\n\n    model = HfApiModel(\"Qwen/Qwen2.5-Coder-32B-Instruct\")\n\n    agent = CodeAgent(\n        tools=[],\n        model=model,\n        sandbox=E2BSandbox(),  # Configure the sandbox\n        additional_authorized_imports=[\"numpy\"],  # Authorize numpy import\n    )\n\nImplement a Tool-Calling Agent\n\nSimilar toCodeAgent,ToolCallingAgentis another type of agent available in smolagent library. CodeAgent uses Python code snippets whereas ToolCallingAgent use built-in tool-calling capabilities of LLM providers and generate JSON structures.\n\n    from smolagents import ToolCallingAgent, HfApiModel, DuckDuckGoSearchTool\n\n    agent = ToolCallingAgent(\n        tools=[DuckDuckGoSearchTool()],  \n        model=HfApiModel(model_id=\"Qwen/Qwen2.5-Coder-32B-Instruct\"),  \n        name=\"SearchAgent\",  \n        description=\"An agent that uses DuckDuckGo to search the web.\",  \n        max_steps=5,  \n    )\n\nSet Up Model Integration\n\nLLM models are the most important aspect when creating AI agents. There are many model availables for various tasks and domains. So we can easily integrate models that is required for our task. Below code snippet switches between two different models providers.\n\n    from smolagents import HfApiModel, LiteLLMModel\n\n    # Initialize Hugging Face model\n    hf_model = HfApiModel(model_id=\"Qwen/Qwen2.5-Coder-32B-Instruct\")\n\n    # Initialize LiteLLM model as an alternative model\n    other_model = LiteLLMModel(model_id=\"anthropic/claude-3-sonnet\")\n\n    # Set the model to hf_model or alternative model\n    model = hf_model  # Alternatively, you can switch this to `other_model`"
    },
    {
        "source": "https://nepalprabin.github.io./posts/2020-04-24-alexnet-architecture-explained.html",
        "title": "AlexNet Architecture Explained",
        "full_text": "AlexNet Architecture Explained\n\nAlexNet famously won the 2012 ImageNet LSVRC-2012 competition by a large margin (15.3% vs 26.2%(second place) error rates). Here is the link to originalpaper.\n\nMajor highlights of the paper\n\n- Used ReLU instead of tanh to add non-linearity.\n- Used dropout instead of regularization to deal with overfitting.\n- Overlap pooling was used to reduce the size of the network.\n\n1. Input\n\nAlexNet solves the problem of image classification with subset of ImageNet dataset with roughly 1.2 million training images, 50,000 validation images, and 150,000 testing images. The input is an image of one of 1000 different classes and output is a vector of 1000 numbers.\n\nThe input to AlexNet is an RGB image of size 256*256. This mean that all the images in training set and test images are of size 256*256. If the input image is not 256*256, image is rescaled such that shorter size is of length 256, and cropped out the central 256*256 patch from the resulting image.\n\nsource\n\nThe image is trained with raw RGB values of pixels. So, if input image is grayscale, it is converted into RGB image . Images of size 257*257 were generated from 256*256 images through random crops and it is feed to the first layer of AlexNet.\n\n2. AlexNet Architecture\n\nAlexNet contains five convolutional layers and three fully connected layers - total of eight layers. AlexNet architecture is shown below:\n\nAlexNet Architecture\n\nFor the first two convolutional layers, each convolutional layers is followed by a Overlapping Max Pooling layer. Third, fourth and fifth convolution layers are directly connected with each other. The fifth convolutional layer is followed by Overlapping Max Pooling Layer, which is then connected to fully connected layers. The fully connected layers have 4096 neurons each and the second fully connected layer is feed into a softmax classifier having 1000 classes.\n\n2.1) ReLU Non-Linearity:\n\nThe standard way of introducing nonlinearity is using tanh: f(x) = tanh(x) where f is a function of input x or using f(x) = (1+e-x)-1.\n\nThese are saturating nonlinearities which are much slow than non-saturating nonlinearity f(x) = max(0, x), in terms of training time with gradient descent.\n\nfig. (Tanh and Relu activation functions)\n\nSaturating nonlinearities:These functions have a compact range, meaning that they compress the neural response into a bounded subset of the real numbers. The LOG compresses inputs to outputs between 0 and 1, the TAN H between -1 and 1. These functions display limiting behavior at the boundaries.\n\nTraining network with non-saturating nonlinearity is faster than that of saturating non-linearity.\n\n2.2) Overlapping Pooling:\n\nMax Pooling layers help to down-sample an input representation (image, hidden-layer output matrix, etc.), reducing its dimensionality and allowing for assumptions to be made about features contained in the sub-regions binned. Max Pooling helps to reduce overfitting. Basically, it uses a max operation to pool sets of features, leaving us with a smaller number of them. Max Pooling and Overlapping is same except except the adjacent windows over which the max is computed overlap each other.\n\n“A pooling layer can be thought of as consisting of a grid of pooling units spaced s pixels apart, each summarizing a neighbourhood of size z*z centered at the location of pooling unit. If we set s=z, we obtain traditional local pooling. If we set s < z, we obtain overlapping pooling.\n\nAlexNet Paper (2012)\n\nThe overlapping pooling reduces the top-1 and top-5 error rates by 0.4% and 0.3% compared to non-overlapping pooling, thus finding it very difficult to overfit.\n\n2.3) Reducing Overfitting\n\nVarious techniques are applied to reduce overlapping\n\nData Augmentation\n\nThe most common way to reduce overfitting on image data is data augmentation. It is a strategy to significantly increase the diversity of data available for training the models without collecting new data. Data augmentation includes techniques such as Position augmentation (cropping, padding, rotating, translation, affine transformation), color augmentation(Brightness, contrast saturation, hue) and many other. AlexNet employ two distinct forms of data augmentation.\n\nThe first form of data augmentation is translating the image and horizontal reflections. This is done by extracting random 224*224 patches from 256*256 images and training network on these patches. The second form of data augmentation consists of altering the intensities of RGB channel in training images.\n\nDropout\n\nDropout is a regularization technique to reduce overfitting and improving generalization of deep neural networks. ‘Dropout’ refers to dropping out units(hidden and visible) in a neural network. We can interpret dropout as the probability of training  a given node in a layer, where 1.0 means no dropout and 0.5 means 50% of hidden neurons are ignored.\n\nDropout\n\nReferences:\n\n- ImageNet Classification with Deep Convolutional Neural Networksby Alex Krizhevsky, Ilya Sutskever, and Geoffrey E. Hinton, 2012\n- https://www.learnopencv.com/understanding-alexnet/"
    },
    {
        "source": "https://nepalprabin.github.io./posts/2022-10-19-text-summarization-nlp.html",
        "title": "Text Summarization NLP",
        "full_text": "Text Summarization NLP\n\nText summarization is one of the Natural Language Processing (NLP) tasks where documents/texts are shortened automatically while holding the same semantic meaning. Summarization process generates short, fluent and accurate summary of the long documents. The main idea of text summarization is to find the subset of the most important information from the entire document and present it in a human readable format. Text summarization has its application in other NLP tasks such as Question Answering (QA), Text Classification, Text Generation and other fields.\n\nBased on how the texts are extracted from the documents, the summarization process can be divided into two types: extractive summarization and abstractive summarization.\n\nExtractive Summarization\n\n- Extractive Summarization\n\nImplementing extractive summarization based on word frequency\n\nWe can implement extractive summarization using word frequency in five simple steps:\n\na. Creating word frequency table\n\nWe count the frequency of the words present in the text and create a frequency table which is a dictionary to store the count. While creating the frequency table, we do not account for the stop words present in the text and remove those words.\n\ndef frequency_table(text):\n    # all unique stopwords of english\n    stop_words = set(stopwords.words(\"english\"))\n    words = word_tokenize(text)\n    freq_table = dict()\n\n    # creating frequency table to keep the count of each word\n    for word in words:\n        word = word.lower()\n        if word in stop_words:\n            continue\n        if word in freq_table:\n            freq_table[word] += 1\n        else:\n            freq_table[word] = 1\n\n    return freq_table\n\nb. Tokenizing the sentences\n\nHere we tokenize the sentences using NLTK’s sent_tokenize() method. This separates paragraphs into individual sentences.\n\ndef tokenize_sentence(text):\n    return sent_tokenize(text)\n\nc. Scoring the sentences using term frequency\n\nHere, we score a sentence by its words, by adding frequency of every word present in the sentence excluding stop words. One downside of this approach is, if the sentence is long, the value of frequency increases.\n\ndef term_frequency_score(sentence, freq_table):\n    # dictionary to keep the score\n    sentence_value = dict()\n\n\n    for sentence in sentences:\n        for word, freq in freq_table.items():\n            if word in sentence.lower():\n                if sentence in sentence_value:\n                    sentence_value[sentence] += freq\n                else:\n                    sentence_value[sentence] = freq\n    return sentence_value\n\nd. Finding the threshold score\n\nAfter calculating the term frequency, we calculate the threshold score.\n\ndef calculate_average_score(sentence_value):\n    # To compare the sentences within the text, we assign a score.\n    sum_values = 0\n    for sentence in sentence_value:\n        sum_values += sentence_value[sentence]\n\n    # Calculating average score of the sentence. This average score can be a good threshold.\n    average = int(sum_values / len(sentence_value))\n\n    return average\n\ne. Generating the summary based on the threshold value\n\nBased on the threshold value, we generate the summary of the text.\n\ndef create_summary(sentences, sentence_value, threshold):\n  # Applying the threshold value and storing sentences in an order into the summary.\n  summary = ''\n  for sentence in sentences:\n      if (sentence in sentence_value) and (sentence_value[sentence] > (1.2 * threshold)):\n          summary += \" \"+ sentence\n  return summary\n\nAbstractive Summarization\n\n- Abstractive Summarization\n\nAbstractive Summarization using Transformers\n\nTransformers is an architecture which uses attention mechanisms to solve sequence to sequence problems while solving long term dependencies. Ever since it was introduced in 2017, transformers have been widely used in various NLP tasks such as text generation, question answering, text classification, language translation and so on. The transformer architecture consists of encoder and decoder parts. The encoder component consists of 6 encoders each of which consists of two sub layers: self-attention and feed forward networks. The input text is first converted into vectors using text embedding methods. Then the vector is passed into the self attention layer and the output from the self attention layer is passed through the feed forward network. The decoder also consists of both self attention and feed forward network layer. An additional layer is present in between these components which is an attention layer that helps the decoder to focus on the relevant parts of the input sentence.\n\nHuggingface Transformers provide various pre-trained models to perform NLP tasks. It provides APIs and tools to download and train state-of-the-art pre-trained models. Not only NLP, huggingface supports Computer Vision tasks like image classification, object detection and segmentation, audio classification and recognition, and multimodal tasks like table question answering, optical character recognition, and many more.\n\nBasic transformer pipeline for summarization\n\nHuggingface transformers provide an easy to use model for inference using pipeline. These pipelines are the objects that hide complex code and provide a simple API to perform various tasks.\n\nfrom transformers import pipeline\n\nclassifier = pipeline(\"summarization\")\ntext = \"\"\"Acnesol Gel is an antibiotic that fights bacteria. It is used to treat acne, which appears as spots or pimples on your face, chest or back. This medicine works by attacking the bacteria that cause these pimples.Acnesol Gel is only meant for external use and should be used as advised by your doctor. You should normally wash and dry the affected area before applying a thin layer of the medicine. It should not be applied to broken or damaged skin.  Avoid any contact with your eyes, nose, or mouth. Rinse it off with water if you accidentally get it in these areas. It may take several weeks for your symptoms to improve, but you should keep using this medicine regularly. Do not stop using it as soon as your acne starts to get better. Ask your doctor when you should stop treatment. Common side effects like minor itching, burning, or redness of the skin and oily skin may be seen in some people. These are usually temporary and resolve on their own. Consult your doctor if they bother you or do not go away.It is a safe medicine, but you should inform your doctor if you have any problems with your bowels (intestines). Also, inform the doctor if you have ever had bloody diarrhea caused by taking antibiotics or if you are using any other medicines to treat skin conditions. Consult your doctor about using this medicine if you are pregnant or breastfeeding.\"\"\"\nclassifier(text)\n\nResult:\n[{'summary_text': ' Acnesol Gel is an antibiotic that fights bacteria that causes pimples . It is used to treat acne, which appears as spots or pimples on your face, chest or back . The medicine is only meant for external use and should be used as advised by your doctor .'}]\n\nThepipeline()takes the name of the task to be performed (if we want to perform a question-answering task, then we can simply pass “question-answering” into the pipeline() and it automatically loads the model to perform the specific task.\n\nFine-tuning summarization model for medical dataset\n\nSummarization using abstractive technique is hard as compared to extractive summarization as we need to generate new text as the output. Different architectures like GTP, T5, BART are used to perform summarization tasks. We will be using the PubMed dataset. It contains datasets of long and structured documents obtained from PubMed OpenAccess repositories. from datasets import load_dataset\n\npubmed = load_dataset(\"ccdv/pubmed-summarization\")\n\nThe PubMed dataset contains article, abstract and section_names as columns. The first step after loading the dataset is tokenizing the training data. Tokenization is the process of splitting paragraphs, sentences into smaller units called tokens. tokenizer = AutoTokenizer.from_pretrained(‘facebook/bart-large-cnn’)\n\nThe next step is to preprocess the data. Before training the data, we need to convert our data into expected model input format.\n\ndef preprocess_function(examples):\n    inputs = [doc for doc in examples[\"article\"]]\n    model_inputs = tokenizer(inputs, max_length=1024, truncation=True)\n\n    labels = tokenizer(examples[\"abstract\"], max_length=128, truncation=True, padding=True)\n\n    model_inputs[\"labels\"] = labels[\"input_ids\"]\n    return model_inputs\n\nWe need to apply the processing function over the entire dataset. Setting flagbatched=Truehelps to speed up the processing of multiple elements of the dataset at once.\n\ntokenized_pubmed = pubmed.map(preprocess_function, batched=True)\n\nNext, we need to create a batch for all the examples. Huggingface provides a data collator to create a batch for the examples.\n\ntokenized_datasets = tokenized_pubmed.remove_columns(pubmed[\"train\"].column_names)\ndata_collator = DataCollatorForSeq2Seq(tokenizer=tokenizer, model=\"facebook/bart-large-cnn\")\n\nHuggingface provides various pre-trained models that we can leverage to perform a variety of machine learning tasks.\n\nmodel = AutoModelForSeq2SeqLM.from_pretrained(model)\n\nBefore training the model, we need to define our training hyperparamaters using training arguments. Since text summarization is a sequence to sequence tasks, we are using Seq2SeqTrainingArguments. And, we need to define our trainer by passing training and test dataset along with training arguments.\n\n# training arguments\ntraining_arguments = Seq2SeqTrainingArguments(\n            output_dir='./results',\n            evaluation_strategy='epoch',\n            learning_rate=2e-5,\n            per_device_train_batch_size=8,\n            per_device_eval_batch_size=8,\n            weight_decay=0.01,\n            save_total_limit=3,\n            num_train_epochs=3,\n            # remove_unused_columns=False,\n            # fp16=True,\n            )\n\n\ntrainer = Seq2SeqTrainer(\n    model=model,\n    args=training_arguments,\n    train_dataset=tokenized_pubmed['train'],\n    eval_dataset=tokenized_pubmed['validation'],\n    tokenizer=tokenizer,\n    data_collator=data_collator\n    )\n\nThe last step is to calltrain()to fine-tune our model.\n\ntrainer.train()"
    },
    {
        "source": "https://nepalprabin.github.io./posts/2023-07-04-augmented-language-models.html",
        "title": "Augmenting Large Language Models: Expanding Context and Enhancing Relevance",
        "full_text": "Augmenting Large Language Models: Expanding Context and Enhancing Relevance\n\nWith the rise of ChatGPT and other large language models (LLMs), the potential for AI to surpass human capabilities has become a topic of both fascination and concern. While LLMs excel at understanding language, following instructions, and reasoning, they often fall short when it comes to performing specific tasks. Simply inputting a prompt into ChatGPT may result in answers that are unrelated or out of context, a phenomenon known as “hallucination.” To obtain relevant information, it is crucial to provide the model with the appropriate context. However, the size of the context window is limited, posing a challenge in capturing all necessary information. Although the context size has increased over time, storing extensive information within a fixed context window remains impractical and expensive. This is where the augmentation of language models comes into play.\n\nAugmenting large language models involves three primary approaches:\n\n- retrieval,\n- chains, and\n- tools.\n\nThese methods aim to enhance the capabilities of LLMs by providing them with additional resources and functionalities.\n\nRetrieval Augmentation:\n\nRetrieval augmentation involves leveraging an external corpus of data for the language model to search through. Traditionally, retrieval algorithms employ queries to rank relevant objects in a collection, which can include images, texts, documents, or other types of data. To enable efficient searching, the documents and their corresponding features are organized within an index. This index maps each feature to the documents containing it, facilitating quick retrieval. Boolean search determines the relevance of documents based on the query, while ranking is typically performed using algorithms like BM25 (Best Match 25).\n\nBM25 (Best Match 25) is a ranking function commonly used in information retrieval to measure the relevance of a document to a given query. It is a probabilistic retrieval model that enhances the vector space model by incorporating document length normalization and term frequency saturation.\n\nIn BM25, the indexing process involves tokenizing each document in the collection into terms and calculating term statistics such as document frequency (df) and inverse document frequency (idf). Document frequency represents the number of documents in the collection containing a particular term, while inverse document frequency measures the rarity of the term across the collection.\n\nDuring the querying phase, the query is tokenized into terms, and term statistics, including query term frequency (qtf) and query term inverse document frequency (qidf), are computed. These statistics capture the occurrence and relevance of terms in the query.\n\nWhile traditional retrieval methods primarily rely on keyword matching and statistical techniques, modern approaches leverage AI-centric retrieval methods that utilize embeddings. These methods offer improved search capabilities and help retrieve contextually relevant information.\n\nChains\n\nChains involve using the output of one language model as the input for another. By cascading multiple models together, the output of each model becomes the input for the subsequent one. This chaining process allows the models to build upon each other’s knowledge and reasoning abilities, potentially leading to more accurate and contextually appropriate responses.\n\nThe sequential arrangement of models in a chain creates a pipeline of of interconnected language models, where the output of one model serves as the input for the next. This pipeline allows for a cascading flow of information and reasoning, enabling the models to collectively enhance their understanding and generate more accurate responses. By leveraging a chain of language models, each model can contribute its specialized knowledge and capabilities to the overall task. For example, one model may excel at language comprehension, while another may possess domain-specific knowledge.\n\nAs the input passes through the chain, each model can refine and expand upon the information, leading to a more comprehensive and contextually relevant output. The chaining process in language models has the potential to address the limitations of individual models, such as hallucination or generating irrelevant responses. By combining the strengths of multiple models, the pipeline can help mitigate these issues and produce more reliable and accurate results.\n\nFurthermore, the pipeline can be customized and tailored to specific use cases or tasks. Different models can be integrated into the chain based on their strengths and compatibility with the desired objectives. This flexibility allows for the creation of powerful and specialized systems that leverage the collective intelligence of multiple language models.\n\nLangchain\n\nLangchainhas emerged as an immensely popular tool for constructing chains of language models, making it one of the fastest-growing open-source projects in this domain. With support for both Python and JavaScript, it provides a versatile platform for building applications and can be seamlessly integrated into production environments. Langchain serves as the fastest way to kickstart development and offers a wide range of pre-built chains tailored for various tasks. Many developers find inspiration from Langchain and end up creating their own customized chaining solutions. One of the key strengths of Lang chain lies in its extensive repository, which houses numerous examples of different chaining patterns. These examples not only facilitate idea generation but also serve as valuable resources for learning and gaining insights into effective chaining techniques. Whether for rapid prototyping or constructing production-grade systems, Lang chain strikes a balance between ease of use and flexibility, empowering developers to effortlessly create their own chaining systems when needed.\n\nThe building block of Langchain are chains. Chains can be simple/generic or specialized. One simple chain is a generic chain that contains a single LLM. Generic chain takes a prompt and uses LLM for text generation based on the prompt. Let’s see how to achieve a simple chain using OpenAI’s gpt-3.5 turbo model.\n\nimport os\nos.environ[\"OPENAI_API_KEY\"] = \"...\"\n\nfrom langchain.prompts import PromptTemplate\n\ntemplate = \"\"\"\n        Who won the oscar for the best actor in  a leading role on {year}?\n    \"\"\"\n\nprompt = PromptTemplate(\n    input_variables=[\"year\"],\n    template=template,\n)\n\nprint(prompt.format(year=2012))\n\nOutput: Who won the oscar for the best actor in  a leading role on 2012?\n\nPromptTemplatehelps to design prompt for your tasks and you can provide input variables if you want like below:\n\ntemplate = \"\"\"\n        Who won the oscar for the best {role} on {year}?\n    \"\"\"\n\nWhile creating a prompt template for multiple variables, you need to pass all those variables ininput_variablesargument\n\nprompt = PromptTemplate(\n    input_variables=[\"role\", \"year\"],\n    template=template,\n)\n\nTools\n\nThe another way to give LLMs access to outside world is to let them use tools.\n\nUsing Tools in Langchain\n\nTools are the flexible way to augment language model with external data. There are two ways to build tools into language models. First way is to manually create chains whereas the later one is the use of plugins and letting the model figure it out. Some example tools that can be use includes Arxiv, Bash, Bing Search, Google, etc.\n\nTools can be used in langchain using following code snippet (in Python):\n\nfrom langchain.agents import load_tools\ntool_names = [...]\ntools = load_tools(tool_names)\ntools\n\nYou can name the tools that you are going to use and load them using load_tools methods\n\nLet’s use Python’s requests module as a tool to extract data from the web\n\nfrom langchain.agents import load_tools\n\ntool_names = ['requests_all']\nrequests_tools = load_tools(tool_names)\nrequests_tools\n\nOutput: \n[\n  RequestsGetTool(name='requests_get', description='A portal to the internet. Use this when you need to get specific content from a website. Input should be a  url (i.e. https://www.google.com). The output will be the text response of the GET request.', args_schema=None, return_direct=False, verbose=False, callbacks=None, callback_manager=None, handle_tool_error=False, requests_wrapper=TextRequestsWrapper(headers=None, aiosession=None)), \n  RequestsPostTool(name='requests_post', description='Use this when you want to POST to a website.\\n    Input should be a json string with two keys: \"url\" and \"data\".\\n    The value of \"url\" should be a string, and the value of \"data\" should be a dictionary of \\n    key-value pairs you want to POST to the url.\\n    Be careful to always use double quotes for strings in the json string\\n    The output will be the text response of the POST request.\\n    ', args_schema=None, return_direct=False, verbose=False, callbacks=None, callback_manager=None, handle_tool_error=False, requests_wrapper=TextRequestsWrapper(headers=None, aiosession=None)), \n  RequestsPatchTool(name='requests_patch', description='Use this when you want to PATCH to a website.\\n    Input should be a json string with two keys: \"url\" and \"data\".\\n    The value of \"url\" should be a string, and the value of \"data\" should be a dictionary of \\n    key-value pairs you want to PATCH to the url.\\n    Be careful to always use double quotes for strings in the json string\\n    The output will be the text response of the PATCH request.\\n    ', args_schema=None, return_direct=False, verbose=False, callbacks=None, callback_manager=None, handle_tool_error=False, requests_wrapper=TextRequestsWrapper(headers=None, aiosession=None)), \n  RequestsPutTool(name='requests_put', description='Use this when you want to PUT to a website.\\n    Input should be a json string with two keys: \"url\" and \"data\".\\n    The value of \"url\" should be a string, and the value of \"data\" should be a dictionary of \\n    key-value pairs you want to PUT to the url.\\n    Be careful to always use double quotes for strings in the json string.\\n    The output will be the text response of the PUT request.\\n    ', args_schema=None, return_direct=False, verbose=False, callbacks=None, callback_manager=None, handle_tool_error=False, requests_wrapper=TextRequestsWrapper(headers=None, aiosession=None)), \n  RequestsDeleteTool(name='requests_delete', description='A portal to the internet. Use this when you need to make a DELETE request to a URL. Input should be a specific url, and the output will be the text response of the DELETE request.', args_schema=None, return_direct=False, verbose=False, callbacks=None, callback_manager=None, handle_tool_error=False, requests_wrapper=TextRequestsWrapper(headers=None, aiosession=None))\n]\n\nEach tool inside therequest_alltool contains a request wapper. We can directly work with these wrappers as below:\n\nrequests_tools[0].requests_wrapper\n\nOutput:\nTextRequestsWrapper(headers=None, aiosession=None)\n\nWe can useTextRequestsWrapperto create a request object and use the object to extract data from the web.\n\nfrom langchain.utilities import TextRequestsWrapper\n\nrequests = TextRequestsWrapper()\n\nrequests.get(\"https://reqres.in/api/users?page=2\")\n\nOutput:\n'{\"page\":2,\"per_page\":6,\"total\":12,\"total_pages\":2,\"data\":[{\"id\":7,\"email\":\"michael.lawson@reqres.in\",\"first_name\":\"Michael\",\"last_name\":\"Lawson\",\"avatar\":\"https://reqres.in/img/faces/7-image.jpg\"},{\"id\":8,\"email\":\"lindsay.ferguson@reqres.in\",\"first_name\":\"Lindsay\",\"last_name\":\"Ferguson\",\"avatar\":\"https://reqres.in/img/faces/8-image.jpg\"},{\"id\":9,\"email\":\"tobias.funke@reqres.in\",\"first_name\":\"Tobias\",\"last_name\":\"Funke\",\"avatar\":\"https://reqres.in/img/faces/9-image.jpg\"},{\"id\":10,\"email\":\"byron.fields@reqres.in\",\"first_name\":\"Byron\",\"last_name\":\"Fields\",\"avatar\":\"https://reqres.in/img/faces/10-image.jpg\"},{\"id\":11,\"email\":\"george.edwards@reqres.in\",\"first_name\":\"George\",\"last_name\":\"Edwards\",\"avatar\":\"https://reqres.in/img/faces/11-image.jpg\"},{\"id\":12,\"email\":\"rachel.howell@reqres.in\",\"first_name\":\"Rachel\",\"last_name\":\"Howell\",\"avatar\":\"https://reqres.in/img/faces/12-image.jpg\"}],\"support\":{\"url\":\"https://reqres.in/#support-heading\",\"text\":\"To keep ReqRes free, contributions towards server costs are appreciated!\"}}'\n\nReferences\n\n- Full Stack Deep Learning (LLM Bootcamp)\n- Langchain"
    },
    {
        "source": "https://nepalprabin.github.io./posts/2020-08-15-deep-convolutional-general-adversarial-networks-dcgans.html",
        "title": "Deep Convolutional Generative Adversarial Networks (DCGANs)",
        "full_text": "Deep Convolutional Generative Adversarial Networks (DCGANs)\n\nDCGAN (Deep Convolutional General Adversarial Networks) uses convolutional layers in its design.\n\nArchitectural Details for DCGAN\n\n- Comprised convolutional network without max-pooling. Instead, it uses convolutional stride and transpose convolution for downsampling and upsampling respectively. To find out how pooling and convolutional stride differs please go throughthis.\n- Removed all fully connected layers\n- Used batch normalization to bring stability in learning. It is done by normalizing the input to have zero mean and a variance of one. Batchnormalization was added to all the layers except generator output layer and discriminator input layer\n- ReLU activation is used in the generator except for the output layer which uses tanh activation function\n- LeakyReLU activation is used at all layers in the discriminator\n\nTraining Generator in DCGAN\n\n[latexpage]Generator takes a uniform noise distribution\\(z\\)as input. This input is reshaped with the help of fully connected layer into three dimensional layer with small base (width * height) and depth. Then, using transposed convolution, the output from previous layer is upsampled. Each transoposed convolution layer is followed by batch normalization to normalize the input. This helps in stabilizing the training of our GAN.\n\nsource\n\nDetails of Adversarial Training\n\nDCGAN was trained on three datasets: Large-scale Scene Understanding (LSUN), ImageNet-1k and Faces dataset.\n\n- Training images were scaled to the range of tanh activation function [-1, 1] and no further pre-processing was performed\n- All models were trained with mini-batch size of 128\n- Weights were initialized from normal normal distribution with mean 0 and standard deviation of 0.2\n- Incase of LeakyReLU, the value of alpha was set to 0.2\n- Adam optimizer was used for updating weights. Learning rate was set to 0.001 and momentum term was reduced to 0.5 from 0.9\n\nDataset Details\n\n- DCGAN model was trained on LSUN bedroom dataset comprising over 3 million training images.\n- No data augmentation was used\n- De-duplication process was performed to decrease the likelihood of generator memorizing input examples. For this, autoencoder was trained to find and delete similar points from the training dataset. De-duplication process helped in removing 275k images.\n\nGenerated bedrooms after five epochs of trainingsource\n\nGenerated bedrooms after five epochs of trainingsource\n\nReferences\n\n- Unsupervised Representation Learning with Deep Convolutional Generative Adversarial Networks\n- Henry AI Labs"
    },
    {
        "source": "https://nepalprabin.github.io./posts/2020-09-21-mobilenet-architecture-explained.html",
        "title": "MobileNet Architecture Explained",
        "full_text": "MobileNet Architecture Explained\n\nIn this blog post, I will try to write about the MobileNets and its architecture. MobileNet uses depthwise separable convolutions instead of standard convolution to reduce model size and computation. Hence, it can be used to build light weight deep neural networks for mobile and embedded vision applications.\n\nTopics Covered\n\n- Standard convolutions and depthwise separable convolutions\n- MobileNet Architecture\n- Width Multiplier to achieve thinner models\n- Resolution Multiplier for reduced representation\n- Architecture Implementation\n\nStandard convolutions and depthwise separable convolutions\n\nConvolution operation consists of an input image, a kernel or filter that slides through the input image and outputs a feature map. The main aim of convolution operation is to extract features from the input image. As we know, every image can be considered as a matrix of pixel values. Consider an input as 5x5 matrix with values of pixels 0 and 1 as shown below:\n\nAlso, consider another 3x3 matrix as below:\n\nThe convolution operation for input size 5x5 with filter of 3x3 is shown below:\n\nFig: The Convolution operation.source\n\nWe are sliding the 3x3 matrix over 5x5 input matrix and performing element-wise matrix multiplication and adding the multiplication output to get convolved feature. The output obtained from such operation is also called as feature map. The 3x3 matrix that is sliding over the input matrix is known as filter or kernel. More on convolution can be found at this amazingarticle.\n\nSeparable Convolutions\n\nBefore knowing what depth-wise separable convolutions do, let’s know about separable convolutions. There are two types of separable convolutions:spatial separable convolutionsanddepthwise separable convolutions.\n\nSpatial separable convolutions\n\nSpatial Separable convolutions deals with spatial dimension of the image (width and height). It divides a kernel into two smaller kernel. For example, a\\(3\\*3\\)kernel is divided into a\\(3\\*1\\)and a\\(1\\*3\\)kernel.\n\nHere, instead of doing one convolution with 9 multiplicants, we can do two convolutions with 3 multiplications each (i.e., 6 in total) to achieve the same effect. With less multiplications, computational complexity goes down and network is able is run faster.\n\nOne of the famous convolution used to detect edges i.e., Sobel kernel can also be separated spatially.\n\nThough, less computation power is achieved using spatial separable convolution, all the kernels cannot be separated into two smaller kernels, which is one of the cons of spatial separable convolution.\n\nDepthwise Separable Convolutions\n\nDepthwise Separable Convolutions is what Mobilenet architecture is based on. Depthwise separable convolution works with kernel that cannot be factored into two smaller kernels. Spatial separable convolutions deals with spatial dimensions but depthwise separable convolutions deals with depth dimension also.\n\nDepthwise separable convolution is a factorized convolution that factorizes standard convolution into a depthwise convolution and a\\(1*1\\)convolution called pointwise convolution. Depthwise separable convolutions splits kernel into two separate kernels for filtering and combining. Depthwise convolution is used for filterning whereas pointwise convolution is used for combining.\n\nUsing depthwise separable convolutions, the total computation required for the operation is the sum of depthwise convolution and pointwise convolution which is:\n\nFor standard convolution, total computation is:\\(D_K . D_K . M . N . D_F . D_F\\), where computational cost depends on number of input channels\\(M\\), number of output channels\\(N\\), kernel size\\(D_K\\)and feature map size\\(D_F\\).\n\nBy expressing convolution as a two steps process of filtering and combining, total reduction in computation is:\n\n\\(\\frac{D_K . D_K . M . D_F . D_F + M . N . D_F . D_F}{D_K . D_K . M. N. D_F . D_F}\\), which is equivalent to\\(\\frac{1}{N} + \\frac{1}{D_k^2}\\)\n\nThat means when\\(D_K * D_K\\)is 3*3, computation cost can be reduced to 8 to 9 times.More on depthwise separable convolutions can be foundhere.\n\nMobileNet Architecture\n\n- As mentioned above, mobilenet is built on depthwise separable convolutions, except for first layer. First layer is a full convolutional layer.\n- All layers are followed by batch normalization and ReLU non-linearity. However, final layer is a fully connected layer without any non-linearity and feeds to the softmax for classification.\n- For down sampling, strided convolution is used for both depthwise convolution as well as for first fully convolutional layer.\n- The total number of layers for mobilenet is 28 considering depthwise and pointwise convolution as separate layers.\n\nfig. (left) Standard convolution with batchnorm and relu(right) depthwise and pointwise convolution followed by batchnorm and relusource\n\nMobileNet architecture is shown below:\n\nFig. MobileNet architecture\n\nWidth Multiplier to achieve Thinner Models\n\nThough our mobilenet model is smaller and computationally less expensive, sometimes we need our model to be more smaller and less expensive in terms of computation. To construct these models, a separate parameter\\(\\alpha\\)is used called as width multiplier. Width multiplier helps to make network thinner uniformly at each layer. For any given layer and width multiplier\\(\\alpha\\), the number of input channels\\(M\\)becomes\\(\\alpha M\\)and the number of output channel\\(N\\)becomes\\(\\alpha N\\). Then, the computational cost for depthwise separable convolution with width multiplier becomes:\n\n\\(D_K . D_K . \\alpha M . D_F . D_F + \\alpha M . \\alpha N . D_F . D_F\\)\n\nWidth multiplier can be applied to any model structure to define a new smaller model with a reasonable accuracy, latency and size trade off. It is used to define a new reduced structure that needs to be trained from scratch.MobileNet paper\n\nResolution Multiplier for reduced representation\n\nResolution Multiplier is another parameter for reducing model computational cost. It is represented by\\(\\rho\\). It is applied to the input image and internal representation of every layer is reduced by the same multiplier. The computational cost for depthwise separable convolution with width multiplier becomes:\\(D_K . D_K . \\alpha M . \\rho D\\_F . \\rho D_F + \\alpha M . \\alpha N . \\rho D_F . \\rho D_F\\)\n\nThe value of\\(\\rho\\)= 1 is the base mobilenet and\\(\\rho<1\\)is the reduced computational MobileNets.\n\nArchitecture Implementation\n\nMobileNet uses depthwise separable convolutions where each layers is followed by BatchNormalization and ReLU non-linearity. MobileNet contains a depthwise and a pointwise convolution layer. The code snippets inspired fromMLT.\n\n# First we will build mobilenet block\ndef mobilenet_block(x, filters, strides):\n  x = keras.layers.DepthwiseConv2D(kernel_size=3, strides=strides, padding='same')(x)\n  x = keras.layers.BatchNormalization()(x)\n  x = keras.layers.ReLU()(x)\n\n  x = keras.layers.Conv2D(filters=filters, kernel_size=1, strides=1, padding='same')(x)\n  x = keras.layers.BatchNormalization()(x)\n  x = keras.layers.ReLU()(x)\n  return x\n\nMobileNet uses input_shape of 224*224*3. First layer of mobilenet is a Convolutional layer with 32 filters, 3*3 kernel and stride of 2. This is followed by BatchNormalization and ReLU non-linearity.\n\nINPUT_SHAPE = 28, 28, 3\ninput = keras.layers.Input(INPUT_SHAPE)\nx = keras.layers.Conv2D(filters=32, kernel_size=3, strides=2, padding='same')(input)\nx = keras.layers.BatchNormalization()(x)\nx = keras.layers.ReLU()(x)\n\nAfter first layers, there is a series of mobilenet block with different kernel sizes and filters.\n\nx = mobilenet_block(x, filters=64, strides=1)\n\nx = mobilenet_block(x, filters=128, strides=2)\nx = mobilenet_block(x, filters=128, strides=1)\n\nx = mobilenet_block(x, filters=256, strides=2)\nx = mobilenet_block(x, filters=256, strides=1)\n\nx = mobilenet_block(x, filters=512, strides=2)\nfor _ in range(5):\n  x = mobilenet_block(x, filters=512, strides=1)\n  x = keras.layers.AveragePooling2D(pool_size=7, strides=1)(x)\n  output = keras.layers.Dense(1000, activation='softmax')(x)\n\nReferences\n\n- MobileNets: Efficient Convolutional Neural Networks for Mobile Vision Applications\n- Machine Learning Tokyo\n- A Basic Introduction to Separable Convolutions\n- An Intuitive Explanation of Convolutional Neural Networks"
    },
    {
        "source": "https://nepalprabin.github.io./posts/2020-06-05-paper-explanation-going-deeper-with-convolutions-googlenet.html",
        "title": "Paper Explanation: Going deeper with Convolutions (GoogLeNet)",
        "full_text": "Paper Explanation: Going deeper with Convolutions (GoogLeNet)\n\nGoogle proposed a deep Convolution Neural Network named inception that achieved top results for classification and detection in ILSVRC 2014.\n\nThe ImageNet Large Scale Visual Recognition Challenge (ILSVRC) evaluates algorithms for object detection and image classification at large scale. One high level motivation is to allow researchers to compare progress in detection across a wider variety of objects – taking advantage of the quite expensive labeling effort. Another motivation is to measure the progress of computer vision for large scale image indexing for retrieval and annotation\n\nhttp://www.image-net.org/challenges/LSVRC/\n\n“Going deeper with convolutions” is actually inspired by an internet meme: ‘We need to go deeper’\n\nIn ILSVRC 2014, GoogLeNet used 12x fewer parameters thanAlexNetused 2 years ago in 2012 competition.\n\nProblems Inception v1 is trying to solve\n\nThe important parts in the image can have large variation in size. For instance, image of object can be in various positions and some pictures are zoomed in and other may get zoomed out. Because of such variation in images, choosing the right kernel size for performing convolution operation becomes very difficult. We require a larger kernel to extract information of object that is distributed more in the picture and a smaller kernel is preferred to extract information of image that is distributed less in the picture.\n\nOne of the major approach to increase the performance of neural networks in by increasing its size. This includes increasing its depth and also its size. Bigger size of neural networks corresponds to larger number of parameters, that makes network more prone to overfitting, especially when labeled training examples are limited.\n\nAnother drawback of increased network size is increased use of computational resources. If more convolution layers are chained then there results in more consumption of computation resources. If these added capacity is used ineffectively, then computation resources get wasted.\n\nSolution\n\nTo solve these issues, this paper comes up with the solution to form a ‘wider’ network rather than ‘deeper’ which is called as Inception module.\n\nThe ‘naive’ inception module performs convolutions on input from previous layer, with 3 different size of kernels or filters specifically 1x1, 3x3, and 5x5. In addition to this, max pooling is also performed. Outputs are then concatenated and sent to the next inception module.\n\nOne problem to the ‘naive’ approach is, even having 5x5 convolutions can lead to require large resource in terms of computations. This problem emerges more once pooling is added.\n\nTo make our networks inexpensive computationally, authors applied dimensionality reductions by adding 1x1 convolutions before 3x3 and 5x5 convolutions. Let’s see how these affect the number of parameters in the neural network.\n\nLet’s see what 5x5 convolution would be computationally\n\nComputation for above convolution operation is:\n\n(5²)(192)(32)(28²) = 120,422,400operations\n\nTo bring down such a great number of operations, dimensionality reduction can be used. Here, it is done by convolving with 1x1 filters before performing convolution with bigger filters.\n\n5×5 Convolution with Dimensionality Reduction\n\nAfter dimensionality reduction number of operations for 5x5 convolution becomes:\n\n(1²)(192)(16)(28²) = 2,408,448operations for the1 × 1convolution and,\n\n(5²)(16)(32)(28²) = 10,035,200operations for the5 × 5convolution.\n\nIn total there will be2,408,448 + 10,035,200 = 12,443,648operations. There is large amount of reduction in computation.\n\nSo, after applying dimensionality reduction, our inception module becomes:\n\nGoogLeNet was built using inception module with dimensionality reduction. GoogLeNet consists of 22 layers deep network (27 with pooling layers included). All the convolutions, including the convolutions inside inception module , uses rectified linear activation.\n\nGoogLeNet incarnation of the Inception architecture.Source: Original Paper\n\nAll the convolutions, including those inside the Inception modules, use rectified linear activation. The size of the receptive field in our network is 224x224 taking RGB color channels with mean sub-traction. “#3x3reduce” and “#5x5reduce” stands for the number of 1x1 filters in the reduction layer used before the 3x3 and 5x5 convolutions. One can see the number of 1x1 filters in the pro-jection layer after the built-in max-pooling in the pool proj column. All these reduction/projection layers use rectified linear activation as well\n\nOriginal Paper\n\nGoogLeNet is 22 layer deep counting only layers with parameters. With such deep network the may arise a problem such as vanishing gradient. To eliminate this, authors introduced auxiliary classifiers that are connected to intermediate layers, and helps the gradient signals to propagate back. These auxiliary classifiers are added on top of the output of Inception (4a) and (4d) modules. The loss from auxiliary classifiers are added during training and discarded during inference.\n\nThe exact structure of the extra network on the side, including the auxiliary classifier, is as follows:\n\n- An average pooling layer with 5x5 filter size and stride 3, resulting in an 4x4 512 output for the (4a), and 4x4 528 for the (4d) stage.\n- A 1x1 convolution with 128 filters for dimension reduction and rectified linear activation.\n- A fully connected layer with 1024 units and rectified linear activation.\n- A dropout layer with 70% ratio of dropped outputs\n- A linear layer with softmax loss as the classifier (predicting the same 1000 classes as the main classifier, but removed at inference time).\n\nThe systematic view of GoogLeNet architecture is shown below:\n\nGoogLeNet architecture\n\nGoogLeNet consists of a total of 9 inception modules namely 3a, 3b, 4a, 4b, 4c, 4d , 4e, 5a and 5b.\n\nGoogLeNet implementation\n\nHaving known about inception module and its inclusion in GoogLeNet architecture, we now implement GoogLeNet intensorflow. This implementation of GoogLeNet is inspired from analytics vidyaarticleon inception net.\n\nImporting the required libraries:\n\nfrom tensorflow.keras.layers import Layer\nimport tensorflow.keras.backend as K\nimport tensorflow as tf\nfrom tensorflow.keras.datasets import cifar10\nfrom tensorflow.keras.models import Model\nfrom tensorflow.keras.layers import Conv2D, MaxPool2D, Dropout, Dense, Input, concatenate, GlobalAveragePooling2D, AveragePooling2D, Flatten\nimport cv2\nimport numpy as np\nfrom keras.utils import np_utils\nimport math\nfrom tensorflow.keras.optimizers import SGD\nfrom tensorflow.keras.callbacks import LearningRateScheduler\n\nNext we are using cifar10 dataset as our data.\n\nnum_classes = 10\ndef load_cifar_data(img_rows, img_cols):\n  #Loading training and validation datasets\n  (X_train, Y_train), (X_valid, Y_valid) = cifar10.load_data()\n  #Resizing images\n  X_train = np.array([cv2.resize(img, (img_rows, img_cols)) for img in X_train[:,:,:,:]])\n  X_valid = np.array([cv2.resize(img, (img_rows, img_cols)) for img in X_valid[:,:,:,:]])\n  #Transform targets to keras compatible format\n  Y_train = np_utils.to_categorical(Y_train, num_classes)\n  Y_valid = np_utils.to_categorical(Y_valid, num_classes)\n  X_train = X_train.astype('float32')\n  X_valid = X_valid.astype('float32')\n  #Preprocessing data\n  X_train = X_train / 255.0\n  Y_train = X_valid / 255.0\n  return X_train, Y_train, X_valid, Y_valid\n\nX_train, Y_trian, X_test, y_test = load_cifar_data(224,224)\n\nNext comes our inception module\n\nInception module contains 1x1 convolutions before 3x3 and 5x5 convolution operations. It takes different number of filters for different convolution operations and concatenate these operations to take into next layer.\n\ndef inception_module(x, filters_1x1, filters_3x3_reduce, filters_3x3, filters_5x5_reduce, filters_5x5, filters_pool_proj, name=None):\n  conv_1x1 = Conv2D(filters_1x1, (1,1), activation='relu', kernel_initializer=kernel_init, bias_initializer=bias_init)(x)\n  conv_3x3 = Conv2D(filters_3x3_reduce, (1,1), padding='same', activation='relu', kernel_initializer=kernel_init, bias_initializer=bias_init)(x)\n  conv_3x3 = Conv2D(filters_3x3, (3,3), padding='same', activation='relu', kernel_initializer=kernel_init, bias_initializer=bias_init)(conv_3x3)\n  conv_5x5 = Conv2D(filters_5x5_reduce, (1,1), padding='same', activation='relu', kernel_initializer=kernel_init, bias_initializer=bias_init)(x)\n  conv_5x5 = Conv2D(filters_5x5, (3,3), padding='same', activation='relu', kernel_initializer=kernel_init, bias_initializer=bias_init)(conv_5x5)\n  pool_proj = MaxPool2D((3,3), strides=(1,1), padding='same')(x)\n  pool_proj = Conv2D(filters_pool_proj, (1, 1), padding='same', activation='relu', kernel_initializer=kernel_init, bias_initializer=bias_init)(pool_proj)\n  output = concatenate([conv_1x1, conv_3x3, conv_5x5, pool_proj], axis=3, name=name)\n  return output\n\nimport tensorflow\nkernel_init = tensorflow.keras.initializers.GlorotUniform()\nbias_init = tensorflow.initializers.Constant(value=0.2)\n\ninput_layer = Input(shape=(224, 224, 3))\nx = Conv2D(64, (7,7), padding='same', strides=(2, 2), activation='relu', name='conv_1_7x7/2', kernel_initializer=kernel_init, bias_initializer=bias_init)(input_layer)\nx = MaxPool2D((3,3), padding='same', strides=(2,2), name='max_pool_1_3x3/2')(x)\nx = Conv2D(64, (1,1), padding='same', strides=(1, 1), activation='relu', name='conv_2a_3x3/1', kernel_initializer=kernel_init, bias_initializer=bias_init)(x)\nx = Conv2D(192, (3,3), padding='same', strides=(1, 1), activation='relu', name='conv_2b_3x3/1', kernel_initializer=kernel_init, bias_initializer=bias_init)(x)\nx = MaxPool2D((3,3), padding='same', strides=(2, 2), name='max_pool_2_3x3/2')(x)\nx = inception_module(x,\n                     filters_1x1=64,\n                     filters_3x3_reduce=96,\n                     filters_3x3=128,\n                     filters_5x5_reduce=16,\n                     filters_5x5=32,\n                     filters_pool_proj=32,\n                     name='inception_3a')\nx = inception_module(x,\n                     filters_1x1=128,\n                     filters_3x3_reduce=128,\n                     filters_3x3=192,\n                     filters_5x5_reduce=32,\n                     filters_5x5=96,\n                     filters_pool_proj=64,\n                     name='inception_3b')\nx = MaxPool2D((3,3), strides=(2, 2), padding='same', name='max_pool_3_3x3/2')(x)\nx = inception_module(x,\n                     filters_1x1=192,\n                     filters_3x3_reduce=96,\n                     filters_3x3=208,\n                     filters_5x5_reduce=16,\n                     filters_5x5=48,\n                     filters_pool_proj=64,\n                     name='inception_4a')\nx1 = AveragePooling2D((5,5), strides=3)(x)\nx1 = Conv2D(128, (1,1), padding='same', activation='relu')(x1)\nx1 = Flatten()(x1)\nx1 = Dense(1024, activation='relu')(x1)\nx1 = Dropout(0.4)(x1)\nx1 = Dense(10, activation='softmax', name='auxiliary_output_1')(x1)\nx = inception_module(x,\n                     filters_1x1=160,\n                     filters_3x3_reduce=112,\n                     filters_3x3=224,\n                     filters_5x5_reduce=24,\n                     filters_5x5=64,\n                     filters_pool_proj=64,\n                     name='inception_4b')\nx = inception_module(x,\n                     filters_1x1=128,\n                     filters_3x3_reduce=128,\n                     filters_3x3=256,\n                     filters_5x5_reduce=24,\n                     filters_5x5=64,\n                     filters_pool_proj=64,\n                     name='inception_4c')\nx = inception_module(x,\n                     filters_1x1=112,\n                     filters_3x3_reduce=144,\n                     filters_3x3=288,\n                     filters_5x5_reduce=32,\n                     filters_5x5=64,\n                     filters_pool_proj=64,\n                     name='inception_4d')\nx2 = AveragePooling2D((5,5), strides=3)(x)\nx2 = Conv2D(128, (1,1), padding='same', activation='relu')(x2)\nx2 = Flatten()(x2)\nx2 = Dense(1024, activation='relu')(x2)\nx2 = Dropout(0.4)(x2)\nx2 = Dense(10, activation='softmax', name='auxiliary_output_2')(x2)\nx = inception_module(x,\n                     filters_1x1=256,\n                     filters_3x3_reduce=160,\n                     filters_3x3=320,\n                     filters_5x5_reduce=32,\n                     filters_5x5=128,\n                     filters_pool_proj=128,\n                     name='inception_4e')\nx = MaxPool2D((3,3), strides=(2,2), padding='same', name='max_pool_4_3x3/2')\nx = inception_module(x,\n                     filters_1x1=256,\n                     filters_3x3_reduce=160,\n                     filters_3x3=320,\n                     filters_5x5_reduce=32,\n                     filters_5x5=128,\n                     filters_pool_proj=128,\n                     name='inception_5a')\nx = inception_module(x,\n                     filters_1x1=384,\n                     filters_3x3_reduce=192,\n                     filters_3x3=384,\n                     filters_5x5_reduce=48,\n                     filters_5x5=128,\n                     filters_pool_proj=128,\n                     name='inception_5b')\nx = GlobalAveragePooling2D(name='avg_pool_5_3x3/1')(x)\nx = Dropout(0.4)(x)\nx = Dense(10, activation='softmax', name='output')(x)\n\nmodel = Model(input_layer, [x, x1, x2], name='inception_v1')\n\nGetting the summary of the model\n\nmodel.summary()\n\nepochs = 25\ninitial_lrate = 0.01\ndef decay(epoch, steps=100):\n    initial_lrate = 0.01\n    drop = 0.96\n    epochs_drop = 8\n    lrate = initial_lrate * math.pow(drop, math.floor((1+epoch)/epochs_drop))\n    return lrate\nsgd = SGD(lr=initial_lrate, momentum=0.9, nesterov=False)\nlr_sc = LearningRateScheduler(decay, verbose=1)\nmodel.compile(loss=['categorical_crossentropy', 'categorical_crossentropy', 'categorical_crossentropy'], loss_weights=[1, 0.3, 0.3], optimizer=sgd, metrics=['accuracy'])\n\nUsing our model to fit the training data\n\nhistory = model.fit(X_train, [y_train, y_train, y_train], validation_data=(X_test, [y_test, y_test, y_test]), epochs=epochs, batch_size=256, callbacks=[lr_sc])\n\nReferences\n\n- https://www.analyticsvidhya.com/blog/2018/10/understanding-inception-network-from-scratch/\n- Going Deeper with Convolutions\n- https://towardsdatascience.com/a-simple-guide-to-the-versions-of-the-inception-network-7fc52b863202"
    },
    {
        "source": "https://nepalprabin.github.io./posts/2021-10-25-autocorrect-and-minimum-edit-distance.html",
        "title": "Autocorrect and Minimum Edit Distance",
        "full_text": "Autocorrect and Minimum Edit Distance\n\nThis is my brief note fromDeepLearning.AI’sNLP Specialization Course.\n\nWhat is Autocorrect?\n\nAutocorrect is an application that changes misspelled word into a correct word. When writing messages or drafting an email, you may have noticied that if we type any words that is misspelled, then that word automatically gets corrected with correct spelling and based on the context.\n\nHow does autocorrect work??\n\nWhile typing the document we can see we get automatic correction in our document. The basic working of this automatic correction is:\n\n- Identifying a misspelled word\n- Find the stringsnedit distance away\n- Filter the candidates\n- Calculate word probabilities\n\nNow let’s see each of the points in detail.\n\n1. Identifying a misspelled word:\n\nLet’s say we are writing a sentenceThis is a draft docment of the APIs. Here we can see clearly see that the worddocmentis misspelled. But, how do we know that this is a misspelled word? Well, we will have a dictionary containing all correct words and if we do not encounter given string in the dictionary, that string is obviously a misspelled word.\n\nif word not in vocab:\n  misspelled = True       # If the word is not in vocab, we identify it as a misspelled word.\n\nWhile identifying a misspelled words, we are only looking at the vocab but not the context. Consider a sentenceHello deah. Here,dearis misspelled asdeah. If we writedeerinstead ofdear, then we would not be able to identify misspelled word becausedeeris present in vocab, though it is contextually incorrect.\n\n2. Find strings n edit distance away\n\nEdit is an operation that is performed on a string to change it.\n\n- Types of edit: - Insert (add a letter)‘to’: ‘top’, ‘two’- Delete (remove a letter)‘hat’: ‘ha’, ‘at’, ‘ht’- Switch (swap 2 adjacent letters)‘eta’: ‘eat’, ‘tea’- Replace (change 1 letter to another)‘jaw’: ‘jar’, ‘paw’Using these edits, we can find all possible strings that arenedits away.\n\n3. Filter candidates\n\nAfter findings strings that are n edit distance away, next step is to filter those strings. After applying edits, the strings are compared with the vocab, and if those strings are not present in vocab, they are discarded. This, way we get a list of actual words.\n\n4. Calculate the word probabilities\n\nThe final step is to calculate the word probabilities and find the most likely word from the vocab. Given the sentenceI am learning AI because AI is the new electricity, we find occurrence of each word and calculate the probability. Probability of given wordwcan be calculated as the ratio of the count of wordwto the total size of the corpus. Mathematically:\\(P(w) = \\frac{C(w)}{V}\\),\n\nwhere:\n\n- \\(P(w) - Probability \\ of\\ a\\ word\\)\n- \\(C(w) - Number \\ of \\ times \\ the \\ word \\ appears\\)\n- \\(V    - Total \\ size \\ of \\ the \\ corpus\\)\n\nMinimum Edit Distance\n\nTill now, we have seen how edit distance works and what are its applications in NLP domain. Now let’s look at theminimum edit distance.\n\nMinimum edit distanceis the minimum number of edits required to transform one string to another. It is used in various applications such as spelling correction, machine translation, DNA sequencing, and many more. To calculate minimum edit distance, we use three types of operations which is also discussed above, i.e., insert, delete and replace.\n\nFor example: Consider source worddeerand target worddoor. To change source to target, we need to perform two replace operations i.e., replace each ofetoo. Here number of edits is 2, but in minimum distance distance, there are cost associated with different edit operations.\n\nUsing above table, the edit distance for the above problem is: Edit distance =2 x replace cost=2x2=4\n\nThis is a brute force method where we are simply looking at the source and target word to calculate the edit distance. If we have large sentence, calculating edit distance with mentioned approach becomes tedious. To make things simpler, we can opt for tabular method using Dynamic Programming approaches."
    },
    {
        "source": "https://nepalprabin.github.io./posts/2020-05-09-vggnet-architecture-explained.html",
        "title": "VGGNet Architecture Explained",
        "full_text": "VGGNet Architecture Explained\n\nVGGNet is a Convolutional Neural Network architecture proposed by Karen Simonyan and Andrew Zisserman of University of Oxford in 2014. This paper mailny focuses in the effect of the convolutional neural network depth on its accuracy. You can find the original paper of VGGNet which is titled asVery Deep Convolutional Networks for Large Scale Image Recognition.\n\nArchitecture\n\nThe input to VGG based convNet is a 224*224 RGB image. Preprocessing layer takes the RGB image with pixel values in the range of 0 - 255 and subtracts the mean image values which is calculated over the entire ImageNet training set.\n\nFig. A visualization of the VGG architecture (source)\n\nThe input images after preprocessing are passed through these weight layers. The training images are passed through a stack of convolution layers. There are total of 13 convolutional layers and 3 fully connected layers in VGG16 architecture. VGG has smaller filters (3*3) with more depth instead of having large filters. It has ended up having the same effective receptive field as if you only have one 7 x 7 convolutional layers.\n\nAnother variation of VGGNet has 19 weight layers consisting of 16 convolutional layers with 3 fully connected layers and same 5 pooling layers. In both variation of VGGNet there consists of two Fully Connected layers with 4096 channels each which is followed by another fully connected layer with 1000 channels to predict 1000 labels. Last fully connected layer uses softmax layer for classification purpose.\n\nArchitecture walkthrough:\n\n- The first two layers are convolutional layers with 3x3 filters, and first two layers use 64 filters that results in 224x224x64 volume as same convolutions are used. The filters are always 3x3 with stride of 1\n- After this, pooling layer was used with max-pool of 2x2 size and stride 2 which reduces height and width of a volume from 224x224x64 to 112x112x64.\n- This is followed by 2 more convolution layers with 128 filters. This results in the new dimension of 112x112x128.\n- After pooling layer is used, volume is reduced to 56x56x128.\n- Two more convolution layers are added with 256 filters each followed by down sampling layer that reduces the size to 28x28x256.\n- Two more stack each with 3 convolution layer is separated by a max-pool layer.\n- After the final pooling layer, 7x7x512 volume is flattened into Fully Connected (FC) layer with 4096 channels and softmax output of 1000 classes.\n\nImplementation\n\nNow let’s go ahead and see how we can implement this architecture usingtensorflow. This implementation is inspired from Machine Learning Tokyo’sCNN architectures.\n\nImporting libraries\n\nStarting the convolution blocks with the input layer\n\ninput = Input(shape=(224,224,3))\n\n1st block consists of 2 convolution layer each with 64 filters of 3*3 and followed by a max-pool layer with stride 2 and pool-size of 2. All hidden layer uses ReLU for non-linearity.\n\nx = Conv2D(filters=64, kernel_size=3, padding='same', activation='relu')(input)\nx = Conv2D(filters=64, kernel_size=3, padding='same', activation='relu')(x)\nx = MaxPool2D(pool_size=2, strides=2, padding='same')(x)\n\n2nd block also consists of 2 convolution layer each with 128 filters of 3*3 and followed by a max-pool layer with stride 2 and pool-size of 2.\n\nx = Conv2D(filters=128, kernel_size=3, padding='same', activation='relu')(x)\nx = Conv2D(filters=128, kernel_size=3, padding='same', activation='relu')(x)\nx = MaxPool2D(pool_size=2, strides=2, padding='same')(x)\n\n3rd block consists of 3 convolution layer each with 256 filters of 3*3 and followed by a max-pool layer with stride 2 and pool-size of 2.\n\nx = Conv2D(filters=256, kernel_size=3, padding='same', activation='relu')(x)\nx = Conv2D(filters=256, kernel_size=3, padding='same', activation='relu')(x)\nx = Conv2D(filters=256, kernel_size=3, padding='same', activation='relu')(x)\nx = MaxPool2D(pool_size=2, strides=2, padding='same')(x)\n\n4th and 5th block consists of 3 convolutional layers with 512 filters each. In between these blocks, a max-pool layer is used with stride of 2 and pool-size of 2.\n\nx = Conv2D(filters=512, kernel_size=3, padding='same', activation='relu')(x)\nx = Conv2D(filters=512, kernel_size=3, padding='same', activation='relu')(x)\nx = Conv2D(filters=512, kernel_size=3, padding='same', activation='relu')(x)\nx = MaxPool2D(pool_size=2, strides=2, padding='same')(x)\nx = Conv2D(filters=512, kernel_size=3, padding='same', activation='relu')(x)\nx = Conv2D(filters=512, kernel_size=3, padding='same', activation='relu')(x)\nx = Conv2D(filters=512, kernel_size=3, padding='same', activation='relu')(x)\nx = MaxPool2D(pool_size=2, strides=2, padding='same')(x)\n\nThe output from 5th convolution block is Flattened which gives 4096 units. This fully connected layer is connected to another FC layer having same number of units. The final fully connected layer contains 1000 units and softmax activation which is used for classification of 1000 classes\n\n#Dense Layers\nx = Flatten(x)\nx = Dense(units=4096, activation='relu')(x)\nx = Dense(units=4096, activation='relu')(x)\noutput = Dense(units=1000, activation='softmax')(x)\n\nfrom tensorflow.keras import Model\nmodel = Model(inputs=input, outputs=output)"
    },
    {
        "source": "https://nepalprabin.github.io./posts/2021-07-27-illustrated-vision-transformers.html",
        "title": "Illustrated Vision Transformers",
        "full_text": "Illustrated Vision Transformers\n\nIntroduction\n\nEver since Transformer was introduced in 2017, there has been a huge success in the field of Natural Language Processing (NLP). Almost all NLP tasks use Transformers and it’s been a huge success. The main reason for the effectiveness of the Transformer was its ability to handle long-term dependencies compared to RNNs and LSTMs. After its success in NLP, there have been various approaches to its usage for Computer Vision tasks. This paperAn Image is Worth 16x16 Words: Transformers for Image Recognition at Scaleby Dosovitskiy et al. proposes using the transformer and has achieved some great results in various Computer Vision tasks.\n\nVison Transformer (ViT) makes use of an extremely large dataset while training the model. While training on datasets such as ImageNet (paper labels ImageNet as a mid-sized dataset), the accuracies of the model fall below ResNets. This is because the Transformer lack inductive bias such as translation equivariance and locality, thus it does not generalize well when trained on insufficient data.\n\nOverview of Vision Transformer\n\n- Split image into patches\n- Provide sequence of linear embeddings of these patches as an input to transformer (flattening the image) Here, image patches are treated as the same way as tokens (as in NLP tasks)\n- Add positional embeddings and a learnable embeddingclass(similar to BERT) to each patch embeddings\n- Pass these (patch + positional +class] embeddings through Transformer encoder and get the output values for eachclasstokens\n- Pass the representation ofclassthrough MLP head and get the final class predictions.\n\nMethod\n\nFigure above depicts the overview of Vision Transformer. As shown in the figure, given the image, the image is split into patches. These image patches are flattened and passed to transformer encoder a sequence of tokens. Along with patch embeddings, position embedding is also passed as an input to the transformer encoder. Here position embedding is added along with patch embedding to retain positional information.\n\nHow is an image changed into a sequence of vectors to feed into the transformer encoder?\n\nLet’s decode above figure by taking a RGB image of size\\(256 * 256 * 3\\). The first step is to create patches of size\\(16 * 16\\)from input image. We can create\\(16 * 16 = 256\\)total patches. After splitting input images into patches, another step is to lineary place all splitted images. As seen in the figure, first patch is placed on the left most side and right most on the far right. Then, we linearly project these patches to get\\(1 * 768\\)vector representations. These representation is known as patch embeddings. The size of patch embedding becomes\\(256 * 768\\)(since we have 256 total patches with each patch represented as\\(1 * 768\\)vector.\n\nNext, we prepend learnable embeddingclasstoken and position embeddings along with patch embeddings making the size\\(257 * 768\\). Here, position embeddings are used to retain positional information. After converting images into vector representation, we need to send image in order as transformer doesnot know the order of the patches unlike CNNs. Due to this, we need to manually add some information about the position of the patches.\n\nComponents of Vision Transformer\n\nSince Vision Transformer is based on standard transformer architecture, only difference it being used for image tasks rather than for text, components used here is almost the same. Here, we discuss the components used in Vision transformer along with its significance.\n\nSide note: If you want to dive deep into transformer, thenhereby Jay Alammar is a good place to start with.\n\nPatch embeddings\n\nAs the name of the paper “An Image is worth\\(16 * 16\\)words transformers”, the main take away of the paper is the breakdown of images into patches. Given the image:\\(x \\, \\varepsilon \\, \\mathbb{R}^{(H * W * C)}\\)it is reshaped into 2D flattened patches\\(x_p \\, \\varepsilon \\, \\mathbb{R}^{N*(P^2.C))}\\), where, N=\\(\\frac{H.W}{p^2}\\),\\((P, P)\\)is the resolution of each image patch.\n\nLearnable embeddingclass\n\nA learnable embeding is added to the embeded patches\\(z_0^0 = x_{class}\\). The state of this embedding class at the output of Transformer encoder\\(z_L^0\\)serves as the representation\\(y\\). This classification head is attached to\\(z_L^0\\)during both pre-training and fine-tuning.\n\nPosition Embeddings\n\nPosition Embeddings are added to the patch embeddings along withclasstoken which are then fed into the transformer encoder.\n\nTransformer Encoder\n\nThe transformer encoder is a standard transformer encoder architecture as presented in original transformerpaper. This encoder takes embedded patches (patch embedding, position embedding andclassembedding). The transformer encoder consists of alternating layers of multuheaded self-attention and MLP blocks. Layer Normalization is used before every block and residual connection is used after every block.\n\nUsing hybrid architecture\n\nPreviously, image patches were used to form input sequence, another approach to form input sequence can be the feature map of a CNN (Convolution Neural Network). Here, the patches extracted from CNN map is used as patch embedding. From the paper:\n\nAs an alternative to raw image patches, the input sequence can be formed from feature maps of a CNN. In this hybrid model, the patch embedding projection E (Eq. 1) is applied to patches extracted from a CNN feature map. As a special case, the patches can have spatial size 1x1, which means that the input sequence is obtained by simply flattening the spatial dimensions of the feature map and projecting to the Transformer dimension.\n\nReferences\n\n- An image is worth 16 * 16 words: Transformers for image recognition at scale\n- ViT Blog - Aman Arora\n- The AI Summer"
    }
]